[
  {
    "player_name": "Bert Bell",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/bert_bell.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Hall of Fame: 1963",
    "trivia": "Bert Bell was voted into the Pro Football Hall of Fame as a member of the Class of 1963.\n\nBell, a former quarterback at the University of Pennsylvania, loved his home state so much, being a part of both NFL teams in Pennsylvania had to have been a dream come true for him.\n\nBell was the co-founder and co-owner of the Philadelphia Eagles from 1933-40. During that time he worked with other NFL owners to establish the NFL Draft to create competitive balance.\n\nBell sold the Eagles, and purchased a share of the Pittsburgh Steelers during World War II, and remained in his role from 1940-45. During that time he was outspoken and instrumental in the league still operating during war time.\n\nHis vision for the NFL was intriguing and profound and it was no wonder he was elected NFL Commissioner in 1946, selling his ownership in the Steelers at that point.\n\n\"Bert Bell devoted his life to pro football,\" said Steve Sabol, late President of NFL Films. \"As the NFL's first great commissioner, he shaped his time and the times to come. The rest walk in his footsteps.\"\n\nBell was behind the league's television and anti-gambling policies, and oversaw the merger of the NFL and AFL in 1949.\n\n\"Before Bert Bell, the NFL operated out of a closet, almost,\" said former Philadelphia Eagles Coach Dick Vermeil. \"Most of what you associate with pro football today began with Bert Bell.\"\n\nHis love and passion for football, the NFL and the teams he once owned was on display all the way until his passing. Bell suffered a heart attack while watching the Steelers play the Eagles at Franklin Field on Oct. 11, 1959, and passed away later that day.",
    "stats": ""
  },
  {
    "player_name": "Jerome Bettis",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/jerome_bettis.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: XL | Pro Bowl: 1993, 1994, 1996, 1997, 2001, 2004 | Hall of Fame: 2015 | Hall of Honor: 2017",
    "trivia": "Jerome Bettis was voted into the Pro Football Hall of Fame as a member of the Class of 2015. Bettis was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nBettis, \"The Bus\" was traded to the Steelers from the St. Louis Rams prior to the start of the 1996 season. He played in 192 regular-season games in his 13-year career, registering the sixth-most rushing yards (13,662) in NFL history. He eclipsed the 100-yard mark 61 times in the regular season and three times in the postseason. Bettis scored 78 rushing touchdowns as a Steeler, the second-most in franchise history. His career accolades include six Pro Bowls, first-team All-Pro twice, secondteam All-Pro once and he was named the NFL's Comeback Player of the Year in 1996. He ended his career with a victory in his hometown of Detroit, Mich., as the Steelers captured their fifth Lombardi trophy in Super Bowl XL.\n\nHis NFL playing career ended with a trip back home to Detroit, for Super Bowl XL where he hoisted the Lombardi Trophy, but the excitement wasn't over for Jerome Bettis. The Steelers all-everything running back is part of football immortality as he was elected to the Pro Football Hall of Fame in 2015.\n\nSteelers Nation descended upon Canton, Ohio for his enshrinement, and Bettis thanked them, as well as teammates and others, in his speech.\n\n\"I want to thank you all for appreciating a power running game – 3 yards and a cloud of dust was far better than a 40-yard bomb down the field,\" Bettis told the crowd. \"Thank you for embracing me and my entire family as your own. But thank you most importantly for your support not only of me but my entire team as we went out and played a game we loved and knew we had the support of the best football fans in the world.\n\n\"I've had the best teammates a player could ever ask for. They gave me everything they had every time we stepped onto the football field. Sometimes it wasn't wins, but we knew that we were a family and that we would get the job done.\"\n\nBettis was responsible many times for getting that job done.\n\n\"I have never seen a power back who was as light on his feet as Jerome was,\" said Bill Cowher, who coached Bettis with the Steelers. \"He would make jump cuts in the hole and his shoulders were never anything but parallel to the line of scrimmage. He could see things and get there on his feet. He had the lightest feet for a big back I have ever seen playing the game.\n\n\"The great thing about Jerome was you rarely saw him take a hit. He was always the one who initiated the hit. He had a great sense of balance, a great sense of forward lean. Most of the time he was the one who was able to initiate hits. There were times in the fourth quarter when all he had to do was make a little snip-step and he could make people miss because they had to brace for him. I have never seen a guy who could make people miss in a hole better than him. He could go sideways when he needed to. But the biggest thing he had was his sense of balance and his forward lean.\"\n\nBettis became the fourth Steelers' running back in the Hall of Fame joining Bill Dudley, John Henry Johnson and Franco Harris, who has been a fan of Bettis' since day one.\n\n\"He had a brilliant career, made big plays and was a big factor in the run the Steelers had,\" said Harris. \"It's tough to last with the running style he had. Running backs don't last a long time. He ran tough and ran well.\"\n\nBettis, a favorite among his teammates and Steelers fans, began his career with the Los Angeles Rams in 1993 but had his best days once he was traded to the Steelers on draft day in 1996. Bettis rushed for 10,571 yards with the Steelers, and amassed 13,662 career yards, which puts him sixth overall in NFL history.\n\n\"He was a bruiser,\" said Harris. \"Wow, could he pound that football. He pounded and pounded. He was a great competitor, a great team player. He contributed greatly to those teams. He was one of the main reasons that those teams were successful and accomplished what they did.\n\n\"He went on to put up numbers that were incredible. It was fun to watch him pound and see what he did. We were completely different runners in our styles, but I loved to watch the way he ran. He was so effective.\"\n\nBettis capped his career in fairytale fashion when the Steelers won Super Bowl XL in Bettis' hometown of Detroit, and then he announced his retirement from the podium with the Lombardi Trophy in his hands.\n\n\"You look at his size and tenacity,\" said former teammate Hines Ward. \"To be that size and have quick feet was just amazing. Sometimes you found yourself as a teammate watching like a fan to see him get through a hole, side step somebody, run over somebody and then get up and do his patented 'The Bus' dance. That is what made him such a special running back. You don't see many guys be able to maneuver the holes and run somebody over.\n\n\"To do the things he did at that size is amazing. I don't think there will ever be another big guy like Jerome who did it the way he did and for how long he did it.\"\n\nBettis was the Steelers leading rusher from 1996-2001 and in 2003-04, and he rolled up 50 100-yard games with the team.\n\n\"He was unusual because most backs weren't as big as Jerome,\" said Hall of Fame center Dermontti Dawson, who blocked for Bettis. \"Usually a back of his size would come in on special situations, short to mid-range run plays. But he was a feature back for 13 years in the league. What made him unusual being a larger than normal back, he was so agile and strong he could take the pounding and be the feature back all of that time. He was a phenomenal runner.\n\n\"As an offensive line you love to have a back like Jerome in the backfield. It doesn't take a very big hole for him to get through. People think you had to open up big lanes for a back to run through, but Jerome somehow found a way. If you had a big crease or a small crease, he found his way through there. The advantage for us, Jerome was such a big back and was so powerful as a runner he could give you those extra yards. As an offense that is paramount in the success of the running game.\"\n\nBettis was voted to the Pro Bowl six times and was named first-team All-Pro twice.\n\n\"Jerome Bettis to me was a great player and great ambassador for the Steelers,\" said Hall of Fame cornerback Mel Blount. \"His play was reminiscent of the Steelers of the 1970s when we ran the ball, pounded it and threw it when we had to. We lived and breathed and depended on the running game. That is championship football. You have to be able to run the football, and Jerome did it superbly.\"",
    "stats": ""
  },
  {
    "player_name": "Mel Blount",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/mel_blount.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Pro Bowl: 1975, 1976, 1978, 1979, 1981 | Hall of Fame: 1989 | Hall of Honor: 2017",
    "trivia": "Mel Blount was voted into the Pro Football Hall of Fame as a member of the Class of 1989. Blount was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nThere aren't many players who cause the NFL to change the rules because of their play, but there also weren't many players like Blount.\n\nBlount, the Steelers third round draft pick in 1970 out of Southern University, came into the NFL with everything a coach would want…size, speed, quickness, mental and physical toughness and a work ethic that came from growing up working on a farm in Vidalia, Georgia.\n\n\"Growing up in the South, the youngest of 11 kids, growing up on a farm, my parents were farmers and that is how we made our living,\" said Blount recently while recalling his road to the Hall of Fame. \"We worked the fields, went to school, and this little thing called a football we threw around. We started playing and the next thing you know I get a scholarship to Southern University and I get drafted in the National Football League and came to a great organization like the Steelers.\n\n\"When I came into the league I definitely wasn't ready for it. I was a young guy that had been sheltered growing up during segregation and all of a sudden you are cast into this spotlight and playing this game called pro football. It was a growing experience. You had to learn and learn fast. And to wind up in Canton, Ohio from that experience is unbelievable.\"\n\nBlount didn't take too long to adjust as he worked his way into the starting lineup in the 1972 season, and shut down opposing receivers, not allowing a single touchdown all year. Blount could adjust to cover any type of receiver, but his specialty was the \"bump-and-run,\" and receivers barely stood a chance. It was that ability that caused the NFL to implement the five-yard bump rule in 1977, a rule where the only time a receiver can be bumped by a defender is within five yards of the line of scrimmage.\n\n\"When they changed the bump-and-run rule, we all had to adjust,\" said Blount. \"If you're an athlete, a player, you make the adjustment. You know what the rules are. You play within the rules, and you let your ability take you to whatever it can take you to.\"\n\nBlount arrived at training camp in 1975 with his head shaved, claiming it was to stay cool, but others convinced it was to give him a more menacing look on the field. It apparently worked as he had his best season and was named Associated Press NFL Defensive Player of the Year, finishing the year with 11 interceptions. He finished his career with 57 interceptions and two touchdowns and 13 fumble recoveries with two touchdowns.\n\nBlount was named All-Pro four times and played in five Pro Bowls. He was a key part of the Steelers success in the 1970s, starting and playing a key role in all four Super Bowls during that decade.\n\nBlount still has a presence about him, looking like he could still play cornerback despite retiring more than 30 years ago, but laughs when people suggest it, knowing those days are behind him. They were special days, ones that he never imagined would one day land him in the Hall of Fame.\n\n\"I am grateful, honored and humbled to be in the Hall of Fame,\" said Blount. \"You start to realize the older you get you are in a special place, a place where your name and legacy will live forever. It's surreal and special and I don't take that for granted. I realize I didn't get there by myself. All of the people who worked with us, making us better, you realize that God had his arms around you and watched over you because it's a game very few people get to play and even fewer get to the Hall of Fame.\n\n\"It's an indescribable moment when you are inducted into the Hall of Fame. It's special. You look back at all of the phases of your football career, high school, college, Pop Warner, pro career, and you say man, do I really deserve to be here? It's special. It's a hallowed event and hallowed ground. It's really special. There could never be a greater honor bestowed on a pro athlete, football player, than the Pro Football Hall of Fame.\"",
    "stats": ""
  },
  {
    "player_name": "Terry Bradshaw",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/terry_bradshaw.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Super Bowl MVP: XIII, XIV | Pro Bowl: 1975, 1978, 1979 | NFL MVP: 1978 | Hall of Fame: 1989 | Hall of Honor: 2017",
    "trivia": "Terry Bradshaw was voted into the Pro Football Hall of Fame as a member of the Class of 1989. Bradshaw was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nBradshaw was the No. 1 overall pick in the 1970 NFL Draft and he definitely lived up to the hype. He is one of only 13 overall first picks to be inducted into the Pro Football Hall of Fame, and he definitely earned his Gold Jacket.\n\nBradshaw was at the helm for the Steelers as a rookie, starting eight games and then continuing to be the driving force behind the success of the Steelers' offense.\n\nBradshaw led the team to four Super Bowl championships, being named MVP in Super Bowl XIII and XIV. He passed for 932 yards and nine touchdowns in the four Super Bowl victories and in 19 postseason games passed for 3,833 yards.\n\n\"He had the ability to throw the football,\" said his late Coach Chuck Noll. \"He had the ability to run with it when he had to. He had all kinds of physical abilities, and it was just a question of being able to use that on the field. Terry, without a question, wanted to be the best. When you have somebody who has a great desire to be the best, and works at it, which he did ... Terry worked at it very hard, both physically and mentally, and spent time in the classroom, and on film, and prepared himself very well.\"\n\nHe was also named the NFL's Most Valuable Player in 1978 when he completed 207 passes for 2,915 yards and 28 touchdowns.\n\nThe 'blonde bomber' as he was known finished his career completing 2,025 passes for 27,989 yards and 212 touchdowns.\n\nAs Bradshaw stood on the steps of the Hall of Fame in Canton, Ohio, he reflected on how he ended up there, and those who helped him along the way.\n\n\"When I got the phone call -- those of you that know me know I'm not a man that hides his emotions well – I went nuts,\" Bradshaw told the crowd filled with Steelers fans. \"I went crazy, which I already am anyway. I jumped around, I ran around the house, outside! I just lost it for three days. I said, 'I can't believe this!' And then I stopped and I said, what does it mean? What does all of this mean? It means that yeah, you're one of the best that ever played? I said, no. Wait just a second. Wait just a second. What it means is that in football you never get anything that you don't share with people. You don't get elected into the Hall of Fame by yourself.\"\n\nBradshaw went on to thank his teammates, receivers, running backs, offensive line, tight ends, listing every player who was there for him.\n\n\"All our careers, we were blessed with great people,\" said Bradshaw during his speech. \"I'm a fortunate quarterback to have so much beautiful talent, so many wonderful athletes to go out and get the job done. It allowed me to be the kind of person I was. Go out and be aggressive and to attack.\"\n\nAnd he finished his speech, just like he should have.\n\n\"Pittsburgh... hey, I love you! Thank you! Thank you!\"",
    "stats": ""
  },
  {
    "player_name": "Jack Butler",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/jack_butler.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Pro Bowl: 1955, 1956, 1957, 1958 | Hall of Fame: 2012 | Hall of Honor: 2017",
    "trivia": "Jack Butler was voted into the Pro Football Hall of Fame as a member of the Class of 2012. Butler was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nWhen Butler was inducted, he began his Hall of Fame speech as only Jack Butler could – by telling the Steelers faithful on hand that were chanting, \"Here We Go Steelers, Here We Go,\" time and time again, \"That's enough.\"\n\nAfter waiting for as long as he did to be inducted into the Pro Football Hall of Fame, 53 years, he had every right to say whatever he wanted.\n\nButler, a Pittsburgh native, joined the Steelers in 1951 as a free agent out of St. Bonaventure. He played in 103 games at cornerback in his nine seasons, recording 52 interceptions that helped earn him a spot in the Hall of Fame as one of the Senior Committee nominees.\n\nButler was selected to the NFL's All-Decade Team of the 1950 and when he retired he was second on the NFL's all-time list with 52 interceptions. Butler had four interception returns for a touchdown and had one fumble recovery for a touchdown. He returned his first career interception 52 yards for a touchdown.\n\n\"He was the perfect guy for a defensive back in those days,\" said former teammate Ted Marchibroda. \"He did not have the greatest speed, but he had good speed, good, good size, good hands and his instincts were tremendous. Jack worked at his profession in those days; most guys didn't work as hard as he did.\"\n\nAfter his retirement from the Steelers, Butler went on to a career in scouting, and served as the executive director for BLESTO.\n\nBut it was that day in Canton that was among the best in Butler's life.\n\n\"I never envisioned being here in Canton,\" said Butler. \"This induction is the highest honor I have achieved in my professional career. I have always been grateful and happy to have played, having a 56-year career doing the things I always loved, being involved in professional football – as a player, coach, scout and administrator. I am honored to be included with the great players who preceded me here.\n\n\"I am grateful and proud to be a part of this great Class of 2012 and I congratulate the five tremendous men who join me here. I am thankful to God for all I have been given throughout my life. I am thankful for the support of my family and friends. I am thankful for my brother and sister who are here to witness this, my wife, my children and grandchildren.\n\n\"I am thankful I'm here.\"\n\nLess than a year after his induction, Butler died at the age of 85.\n\n\"Jack was a tremendous player who ranked among the best in league history with his 52 interceptions while only playing in 12 games a year,\" said Steelers Chairman Dan Rooney. \"He was a versatile player who was also used as a wide receiver, but his career ended unfortunately too soon with a bad knee injury. He was an excellent person both on and off the field, and he played an integral role in the BLESTO scouting program and our entire draft process before his retirement. His family was very close to the entire Rooney family, and he will be missed.\"",
    "stats": ""
  },
  {
    "player_name": "Bill Cowher",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/bill_cowher.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: XL | Hall of Honor: 2019 | Hall of Fame: 2020",
    "trivia": "Bill Cowher was inducted into the Steelers Hall of Honor as a member of the Class of 2019. Cowher is also a member of the Pro Football Hall of Fame Class of 2020.\n\nOn Jan. 21, 1992, Bill Cowher became the 15th coach in Steelers history when he was hired to replace Chuck Noll as the second man to hold that job since the 1970 NFL-AFL merger. Dan Rooney's search for Noll's successor came down to two finalists, but he selected Cowher over Dave Wannstedt, a decision that yielded immediate dividends. In Cowher's rookie season as coach, he took what had been a talented team that finished a disappointing 7-9 in 1991 and turned it into an 11-5 AFC Central Division champion that entered those playoffs as the AFC's No. 1 seed. In Cowher's 15 seasons as coach, the Steelers won eight division titles, made the playoffs 10 times during which they participated in 21 playoff games. Those 21 playoff games included six appearances in AFC Championship Games and two trips to the Super Bowl, in which the Steelers were 1-1. Cowher finished his career as one of only six coaches in NFL history with at least seven division titles, and he joined Paul Brown as the only coaches in history to take their teams to the playoffs in each of their first six years as coach.",
    "stats": ""
  },
  {
    "player_name": "Dermontti Dawson",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/dermontti_dawson.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Pro Bowl: 1992, 1993, 1994, 1995, 1996, 1997, 1998 | Hall of Fame: 2012 | Hall of Honor: 2017",
    "trivia": "Dermontti Dawson was voted into the Pro Football Hall of Fame as a member of the Class of 2012. Dawson was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nIt's not often a player comes along who has the ability to redefine the way a position is played. And lucky for the Steelers, when Dawson came along, they found him.\n\nDawson redefined the way center is played in the National Football League, and that is why he was elected to the Pro Football Hall of Fame.\n\n\"What Dermontti did, which is what Mel Blount did, was change the game,\" said ESPN analyst and former Steelers running back Merril Hoge, who played with Dawson from 1989-93. \"You never had a center pull until Dermontti Dawson. He revolutionized and changed how teams ran the football in the NFL. I played with Mike Webster in my first year with the Steelers, and I never thought I would be able to say someone was better than Mike Webster at center. But Dermontti changed how we ran the ball. Who knows if the Steelers would have evolved to where they are today in terms of running the football? It was because of him.\"\n\nHoge left the Steelers for the Chicago Bears via free agency following the 1993 season, and when he arrived there the coaches picked his brain about what made the Steelers running game so successful.\n\n\"When I went to Chicago they asked me to show them how we ran the football,\" said Hoge. \"I drew it up and said, 'We pull the center.' They said, 'We can't do that.' I told them, 'Well then you can't run the ball like we did it in Pittsburgh.'\"\n\nDawson was drafted by the Steelers in the second round in 1988 from Kentucky. He played his entire 13-year career with the Steelers, and he took over for Mike Webster at center in his second season and remained a dominant force at the position throughout his career.\n\nIt wasn't an easy task replacing the legendary Webster, but Dawson's unique talents and leadership ability made him the perfect fit.\n\n\"He had all of the physical tools that were necessary – balance, strength, everything,\" said CBS color analyst Dan Dierdorf, himself a Hall of Fame offensive tackle, at the time of Dawson's induction. \"The one thing that always impressed me was his ability to handle a nose tackle by himself. The majority of centers who play the game almost always need some sort of a double-team, or a rub from the guard next to them. The great centers, and there aren't many of them, block the nose tackle all by themselves, and Dermontti was one of those guys. That's what makes him so special.\"\n\nDawson was without a doubt one of the most athletic offensive linemen in NFL history, and he was durable and dependable as well, as his streak of 170 consecutive games played – second most in Steelers history – proves.\n\nDawson was a seven-time Pro Bowl selection and was a first-team All-Pro six times. He was also named to the NFL's Team of the Decade for the 1990s.\n\n\"Dermontti could just crank you,\" said former Steelers tackle Tunch Ilkin, who played with Dawson from 1988-92. \"He had the ability, the explosive strength and the athleticism to do it, to just knock guys out. He also had that stability to take on guys. He was strong enough to just absorb a 320-pound nose tackle and not give ground.\"\n\nIlkin has seen his share of great centers, also having played with Webster, a Hall of Famer, and he also watched Dwight Stephenson, another Hall of Famer, who played for the Dolphins in the 1980s.\n\n\"The argument used to be back in the early 1980s about who was better, Mike Webster or Dwight Stephenson,\" said Ilkin. \"Dwight was a great center because he was so athletic. Webbie was a great center because he was so strong and tough and smart.\n\n\"You put those two guys together and you have Dermontti Dawson.\"\n\nDawson, always a fan favorite even at a position where players don't get attention from fans, was thankful to all who supported the Steelers throughout his career and beyond during his Hall of Fame enshrinement speech.\n\n\"I took great pride representing the Steelers and the great tradition and the high standards,\" said Dawson. \"Being a Steeler meant being a blue collar worker with an unwavering commitment to excellence, and that's what being a Steeler meant to me. I hope I made the Steelers Nation proud.\n\n\"Thank you to the fans because you guys are what this game is all about. Thank you for your years of support and dedication you have shown to the Pittsburgh Steelers and the NFL. Without you, there is no NFL.\"",
    "stats": ""
  },
  {
    "player_name": "Bill Dudley",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/bill_dudley.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Pro Bowl: 1950, 1951 | Hall of Fame: 1966 | Hall of Honor: 2017",
    "trivia": "Bill Dudley was voted into the Pro Football Hall of Fame as a member of the Class of 1966. Dudley was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nBefore Jerome Bettis, before Franco Harris, and before John Henry Johnson, there was a man who dominated in the backfield for the Pittsburgh Steelers and that was Dudley.\n\nDudley, the Steelers first-round draft choice in 1942 who was nicknamed \"Bullet Bill\", set the standard for the backs that would come after him, despite being a small back at only 5-10, 182 pounds. He was the league's leading rusher his rookie year with 696 yards, earning him all-league honors.\n\n\"We had a lot of fun,\" Dudley was quoted as saying. \"Pittsburgh in 1942 was probably one of the most fun years I ever had. I didn't know anything about Pittsburgh. All the steel mills were in full blast. You couldn't see the sun for the smoke. Probably we'd work out from one to three o'clock in the afternoon, and it was just overcast all morning long.\"\n\nThe next two years Dudley left football, serving in the United States Army Air Corps during World War II as a B-25 and B-29 pilot in the Pacific.\n\nBut football was what he loved, so when he returned it was back to the Steelers during the 1945 season. Dudley's best season in a Steelers uniform came in 1946 when he was named the NFL's Most Valuable Player while leading the league in rushing (604), punt returns (27), and interceptions (10).\n\n\"The Rooney family, I knew Mr. (Art) Rooney very well,\" said Dudley, who was an honorary co-captain when the Steelers kicked off their 75th season in 2007. \"Mr. Rooney Sr., next to my father, was one of the most influential men in my life. I only played three years with them, but the family was so unique and I know they still are. It's a family organization. It's first-class, all business, no messing around.\"\n\nFollowing his time with the Steelers, Dudley went on to play for the Detroit Lions (1947-49) and Washington Redskins (1950-51 and 1953).\n\nDudley, who passed away in 2010 at the age of 88, was humbled to be elected to the Pro Football Hall of Fame as he shared in his induction.\n\n\"There's not much that one who the game of football has meant so much to that you truly can say at this moment,\" said Dudley in Canton, Ohio. \"Football has been a part of my life for the past 35 or 40 well the past 45 years, and I hope it's part of my life for as long as I live and particularly this football Hall of Fame. I feel humble, very humble to be considered to be a member as well as to be considered a part of pro football because it's great today, it was great years ago when it was first started here in Canton, and it'll be greater tomorrow. Thank you.\"",
    "stats": ""
  },
  {
    "player_name": "Alan Faneca",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/alan_faneca.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: XL | Pro Bowl: 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009 | Hall of Honor: 2018 | Hall of Fame: 2021",
    "trivia": "During the days leading up to the 1998 NFL Draft, Jimmy Johnson was surveying the pool of talent. Then the Dolphins coach, Johnson had much draft-day success when he built the Cowboys championship teams of the early 1990s. \"The guy most ready to play in the NFL,\" Johnson told a reporter, \"is that kid Faneca from LSU.\" The Steelers picked Alan Faneca in the first round of the 1998 draft, and he deserves to be recognized as one of the best offensive linemen in franchise history. Faneca was a six-time first-team All-Pro during his years with the Steelers, and he was voted to nine Pro Bowls overall. In 2003, Faneca exhibited uncommon versatility by playing nine games at left tackle when injuries ravaged the line. He was named a member of the Steelers All-Time Team, and a member of the NFL Team of the Decade (2000s).",
    "stats": ""
  },
  {
    "player_name": "Joe Greene",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/joe_greene.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Pro Bowl: 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1978, 1979 | Jersey Retired: 2014 | Hall of Fame: 1987 | Hall of Honor: 2017",
    "trivia": "Joe Greene was voted into the Pro Football Hall of Fame as a member of the Class of 1987. Greene was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nGreene changed what it meant to play for the Pittsburgh Steelers. He changed the mindset of those who wore the black and gold, starting with his teammates in the 1970s, with his impact still lasting today.\n\nGreene, a man who admittedly was disappointed to be drafted in the first-round by the team in 1969 when they were a losing franchise, through his play and dedication made those who were drafted after him honored to be selected by the Pittsburgh Steelers.\n\nGreene, the leader of the Steel Curtain defense for 13 seasons, the Hall of Fame defensive tackle who helped bring four Super Bowl championships to Pittsburgh, the two-time NFL Defensive Player of the Year, is the player who helped shape the franchise and he was honored for everything he did when his No. 75 was retired in 2014, only the second number in franchise history ever to be retired.\n\n\"When you look at it, Joe Greene was the guy who anchored that whole football team,\" said fellow Hall of Famer and former teammate Mel Blount. \"Not just on the field, but Joe Greene was a stabilizer. He kept everything in the locker room even keeled. He was a great leader. Joe Greene was a tremendous guy for the Steelers.\"\n\nGreene was selected to the Pro Bowl 10 times, including eight straight years from 1969-76. He was a five-time first-team All-Pro selection, 11-time first-team All-AFC selection, NFL Defensive Player of the Year twice (1972 and 1974) and NFL Defensive Rookie of the Year in 1969. He was named to the NFL's 75th Anniversary All-Time Team, the 1970s All-Decade Team and the Steelers 75th Anniversary All-Time Team.\n\nGreene's best season came in 1974 when not only was his on field play stellar, earning NFL Defensive Player of the Year honors, but he also was an emotional leader, inspiring his teammates en route to the team's first Super Bowl victory in Super Bowl IX.\n\n\"From an attitude standpoint, a desire, he'd do whatever you had to do to win,\" said his late Coach Chuck Noll. \"He was special from a leadership standpoint. Everybody thinks leadership comes from how you talk, but it really doesn't. Leadership on the field from a football player is how you perform. If you're a performer, you can be a leader. Joe was an outstanding performer, and he led that way.\"\n\nHis performance in the AFC Title game against the Oakland Raiders that led up to the Super Bowl was in one word, dominant.\n\n\"I have the ultimate respect for Joe Greene,\" said former Raiders offensive guard Art Shell. \"He was a great player. He was the catalyst for that football team. Joe was a great player. I think he was the best Steelers player ever. The battles were always fun, a lot of pushing and shoving, a little trash talking afterwards. We had a lot of banter, a lot of fun.\n\n\"His play was intimidating. You would see him walk on the field and he would give you that little sneering smile he had, and he would get a little laugh. Once that ball was snapped, you knew it was a war. He came and brought it every time. You knew you were in a physical battle the whole game.\"\n\nGreene followed that up with an interception and fumble recovery in the win over the Minnesota Vikings in Super Bowl IX, the first of four Super Bowl wins he would be instrumental in.\n\nWhen Greene stood on the steps of the Hall of Fame in Canton, Ohio, with former Coach Chuck Noll as his presenter, his love for the Steelers fans shown through.\n\n\"In Pittsburgh, if you are not at the stadium at 1:00 on Sunday in the fall, you are at the wrong place,\" Greene said in his speech. \"They are always there. Without the fans it is something different and we certainly appreciate and love you for that. And you have impacted my life because you are important.\"",
    "stats": ""
  },
  {
    "player_name": "Kevin Greene",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/kevin_greene.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Pro Bowl: 1989, 1994, 1995, 1996, 1998 | Hall of Fame: 2016 | Hall of Honor: 2017",
    "trivia": "Kevin Greene was voted into the Pro Football Hall of Fame as a member of the Class of 2016 and enshrined on Aug. 6, 2016 after waiting 12 years from the time he retired from the NFL for the honor. Greene was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nGreene was originally drafted by the Los Angeles Rams in the fifth-round in 1985, where he established himself as an elite pass rushing outside linebacker with the Rams, collecting 72 ½ sacks in eight seasons. But the last two years the focus of the Rams defense shifted and for Greene the beginning of NFL free agency in 1993 came at a perfect time.\n\nThe Steelers were in the market for an outside linebacker after not matching an offer sheet to restricted free agent linebacker Jerrol Williams who then went to the San Diego Chargers, and in came Greene.\n\n\"He had such a will to inflict a sack on the quarterback,\" said Steelers' inside linebackers coach Jerry Olsavsky, who played linebacker with Greene. \"Back in 1993 when Kevin showed up here, that was his main goal. He would always say, 'I have to get to the quarterback.' He would remind you, 'I have to get to the quarterback.' It was a running play and he would still say, 'I have to get to the quarterback,' and we would tell him it's a running play.\n\n\"It was great because that's what he had to do. That went over to everyone, Greg (Lloyd), Levon (Kirkland), me and Chad (Brown). Just the history of linebackers, having a guy like that always wanting a sack was great. We are all held to a standard. He held everyone on the defense to the standard, and you had to live up to it or you would hear about it.\"\n\nGreene finished his career with 160 sacks, 26 fumble recoveries, five interceptions, and recorded three safeties. He had double-digit sacks 10 times in his 15 seasons, and he led the NFL in sacks in 1994 (14.0) and 1996 (14.5). He was named to the NFL's All-Decade Team of the 1990s. He was a three-time first-team All-Pro (1989, 1994 and 1996) and a five-time Pro Bowler (1989, 1994-96 and 1998).\n\nDuring his three seasons with the Steelers (1993-95) he recorded 35 ½ sacks, the second most by a player in their first three seasons with the Steelers since sacks became an official statistic in 1982. He finished his career playing for the Carolina Panthers (1996, 1998-99) and San Francisco 49ers (1997).\n\nGreene was a game changer, a player who brought passion on and off the field.\n\n\"I loved getting a sack,\" said Greene. \"First it was a feeling of relief. I know that is what that organization really wanted me to do. They wanted me to rush the passer, defend against the run because you can't be soft against the run and then drop back in coverage and do the things (defensive coordinator) Dom Capers wanted to do.\n\n\"But what they really wanted me to do was crush quarterbacks. When I was really able to do that it was a feeling of relief. My teammates depended on me to do that. I contributed. I didn't want to let my teammates down. I did something to stop that drive. Either I hit the quarterback at the right time and caused a fumble we recovered, or we got an interception. I remember in 1993 I got a hit on Steve Young and the ball floated and Rod (Woodson) came down with the pick. I felt like I was contributing. A sack was different than making a tackle for a loss, or a tackle at the line of scrimmage. It was just me making a contribution and not letting my brothers down.\"",
    "stats": ""
  },
  {
    "player_name": "Jack Ham",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/jack_ham.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Pro Bowl: 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980 | Hall of Fame: 1988 | Hall of Honor: 2017",
    "trivia": "Jack Ham was voted into the Pro Football Hall of Fame as a member of the Class of 1988. Ham was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nThe Steelers selected Jack Ham in the second round of the 1971 NFL Draft and the consistent, steady linebacker played his entire 12-year career in the black and gold.\n\nHam earned a starting job right out of the gate at left outside linebacker as a rookie after picking off three passes in the preseason finale that year. He held onto the starting role through his entire career, showing his durability by missing only four games in his first 10 seasons.\n\nHam was named the Football News Defensive Player of the Year in 1975, and was selected to eight straight Pro Bowls. He was named All-Pro six times and All-AFC seven times.\n\nThe intelligent linebacker who changed the way the position was played outside, was a key component in the Steelers run to their first championship in Super Bowl IX when he returned an interception 19 yards to the Oakland nine-yard line in the 1974 AFC Championship game to put the Steelers in position to score the go-ahead touchdown and advance to the Super Bowl.\n\nHam, who played in five AFC Championship games, was a key component during the team's Super Bowl years, and while he played in Super Bowl IX, X and XIII, he missed Super Bowl XIV because of injuries.\n\nHe retired after the 1982 season with 25 sacks, 21 fumble recoveries and 32 interceptions to his credit. The combined 53 takeaways are the most ever by a non-defensive back. Ham was All-Pro six times, All-AFC seven times and selected to the Pro Bowl eight time.\n\nHe was also named to the NFL's 75th Anniversary Team, the NFL All-Time Team, the Steelers 75th Anniversary Team and the NFL's Team of the Decade for the 1970s.\n\nHam also earned a spot on the coveted Hall of Fame 50th Anniversary Team alongside linebacker Lawrence Taylor.\n\nAndy Russell, who occupied the middle linebacker spot while Jack Lambert held down the other outside spot, wrote about Ham and a game against the San Diego Chargers in 1975. The Steelers had a comfortable lead, when both players were substituted for to give them a rest. As they stood on the sidelines talking about Ham's involvement in the coal business, the Chargers intercepted and returned the ball to the three-yard. Ham was sent back into the game to try and secure a shutout.\n\n\"The first play the Chargers ran was a sweep to the right,\" wrote Russell. \"Bad idea. Ham took their giant tight end, threw him aside, speared the runner behind the line of scrimmage causing him to fumble, which of course Jack recovered. As he slowly walked off the field, he casually flipped the ball to the ref. Returning to our position on the sideline, Jack turned to me smiling and said, 'Where was I?'\"\n\nThe Steelers won the game, 37-0. The rest, as they say, is history.",
    "stats": ""
  },
  {
    "player_name": "Franco Harris",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/franco_harris.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Super Bowl MVP: IX | Pro Bowl: 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980 | Hall of Fame: 1990 | Hall of Honor: 2017",
    "trivia": "Franco Harris was voted into the Pro Football Hall of Fame as a member of the Class of 1990. Harris was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nHarris will forever be remembered for the greatest play not just in Steelers' history, but one recognized by many as the greatest play ever in NFL history, the \"Immaculate Reception.\"\n\nThings looked bleak for the Steelers late in the 1972 AFC Divisional Playoff Game vs. the Oakland Raiders at Three Rivers Stadium, trailing 7-6. Facing a fourth-and-10 from their own 40-yard line with just 22 seconds remaining and desperately searching for the team's first ever playoff appearance, it didn't look promising. But they never gave up. While under pressure Terry Bradshaw threw the ball in the direction of Frenchy Fuqua and as it arrived he collided with Raiders safety Jack Tatum, and the ball ricocheted back and Franco Harris miraculously scooped it out of the air and took off running for a 60-yard touchdown reception that gave the Steelers the 13-7 win and a wild celebration ensued.\n\n\"It's still as exciting,\" said Harris. \"If you look at the season we had in 1972, after the first 40 years of the franchise, and then to have the incredible season, the team's first playoff win and to win that first one in dramatic fashion really started to change a lot of things. What really made it special and big was the decade that was to come and the importance of the play, setting the tone for winning. We proved that no matter how dire the situation that we can win. All of the things that followed made that play so big and important to Steelers' history.\"\n\nThat play was just the start of Harris' greatness as well. Harris was the Steelers first-round draft selection in 1972, the 13th pick overall, and finished his rookie year with 1,055 yards rushing and 10 touchdowns. He would go on to be the greatest running back in team history.\n\nHarris carried the load for the team for 12 seasons, bringing his powerful style to the ground game, and also playing a key role in the passing game. He is the team's all-time leading rusher with 11,950 yards and leads with 91 rushing touchdowns. He finished his career with 12,120 yards after spending his final season in Seattle.\n\nHe had eight 1,000-yard seasons, and rushed for at least 100 yards in 47 games. Harris added 307 receptions for 2,287 yards, and his net yardage of 14,622 yards ranked as third highest when he retired.\n\n\"The first day he came to camp, you could see his ability to make people miss,\" said his late Coach Chuck Noll. \"His quickness, his ability to run with the football was something that was very special. Franco really had great vision. Every good runner I knew had that kind of vision, and he had it right from the start. Not only seeing the holes, but seeing the people. You know, a lot of people come in there and they close their eyes when they're running into the line, but Franco had his eyes wide open. He could pick the holes, and knew the cuts to make.\"\n\nHarris was a member of four Super Bowl championship teams with the Steelers, winning MVP honors for Super Bowl IX when he rushed for 158 yards in a 16-6 win over the Minnesota Vikings. He also was named to the Pro Bowl nine times, and was All-AFC four times.\n\nThe accomplishments throughout his career all came to an amazing end when he was inducted into the Hall of Fame.\n\n\"I have to admit when I put that Hall of Fame jacket on, that was the greatest moment of all time,\" said Harris. \"It was like all the football history from the beginning was just absorbed into me with that jacket. That's what that meant. It was quite an experience.\"\n\nHarris passed away on Dec. 20, 2022, just days before the 50th Anniversary of the Immaculate Reception and having his No. 32 jersey retired.\n\nUpon his passing, Steelers President Art Rooney II issued the following statement.\n\n\"It is difficult to find the appropriate words to describe Franco Harris' impact on the Pittsburgh Steelers, his teammates, the City of Pittsburgh and Steelers Nation. From his rookie season, which included the Immaculate Reception, through the next 50 years, Franco brought joy to people on and off the field. He never stopped giving back in so many ways. He touched so many, and he was loved by so many.\"",
    "stats": ""
  },
  {
    "player_name": "John Henry Johnson",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/john_henry_johnson.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Pro Bowl: 1954, 1962, 1963, 1964 | Hall of Fame: 1987 | Hall of Honor: 2017",
    "trivia": "John Henry Johnson was voted into the Pro Football Hall of Fame as a member of the Class of 1987. Johnson was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nJohnson was the Steelers second pick in the 1953 NFL Draft, but instead of joining the Steelers immediately, he went to the Canadian Football League because the money was better. He was with the CFL for just one year, playing for the Calgary Stampeders, before signing with the San Francisco 49ers, spending three seasons there. Johnson played in what was dubbed the 'Million Dollar Backfield' with the 49ers, along with Joe Perry, Hugh McElhenny and quarterback Y.A. Tittle.\n\nJohnson was traded to the Detroit Lions in 1957, and then acquired by the Steelers via trade in 1960, where he would spend the most productive six seasons of his career.\n\nJohnson carried the ball 118 times for 621 yards and two touchdowns in 1960, and added 213 carries for 787 yards and six touchdowns his second season.\n\n\"You've got to scare your opponent,\" Johnson once said. \"I can run away from a lot of guys after I get them afraid of a collision with me… I always dish out more than I take.\"\n\nIt was in 1962 that he would become the first Steelers player to rush for more than 1,000 yards, with 251 carries for 1,141 yards and seven touchdowns.\n\nHe eclipsed the 1,000 yard mark again in 1964 with 235 carries for 1,048 yards. His best performance that season came against the Cleveland Browns, at a time when the Browns dominated meetings with the Steelers. Johnson rushed for 200 yards and scored three touchdowns in a 23-7 win over the Browns, the only game Cleveland would lose that season as they won the NFL Championship in 1964.\n\nHe finished his Steelers days with 4,383 yards and three Pro Bowl selections.\n\n\"John Henry is my bodyguard,\" his Hall of Fame quarterback Bobby Layne once said. \"Half the good runners will get a passer killed if you keep them around long enough. But a quarterback hits the jackpot when he gets a combination runner-blocker like Johnson.\"\n\nJohnson finished his career with the AFL's Houston Oilers in 1966, and walked away with 6,803 career rushing yards, fourth all-time behind Jim Brown, Jim Taylor and Joe Perry at the time.\n\n\"I was confident someday I would be here, but then on the other hand, I thought I might be dead since it had taken so long,\" said Johnson during his Hall of Fame acceptance speech. \"Today I feel that I finally have that respect, and I wanna tell you, it makes me feel damn good.\"\n\nJohnson died on Friday, June 3, 2011, and upon his passing the Steelers issued the following statement.\n\n\"We are deeply saddened by the death of John Henry Johnson. He was one of the Steelers' great running backs, evident by being the team's first 1,000-yard rusher in 1962. Also known for being one of the greatest blocking backs of his era, John Henry was one of the first in a long line of Steelers' Hall of Famers.\"",
    "stats": ""
  },
  {
    "player_name": "Walt Kiesling",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/walt_kiesling.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Hall of Fame: 1966 | Hall of Honor: 2017",
    "trivia": "Walt Kiesling was voted into the Pro Football Hall of Fame as a member of the Class of 1966. Kiesling was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nOnce his NFL playing days ended, Kiesling stayed right where he spent the previous three years as a player, in Pittsburgh but this time as a coach.\n\nKiesling played guard on offense and defense during his playing years, and dominated games as he was considered to be stronger and tougher than most of the players he went against.\n\nHis career began with the Duluth Eskimos in 1926, then the Pottsville Maroons, before joining the Chicago Cardinals where he played from 1929-33 and blocked for Hall of Fame fullback Ernie Nevers. He opened holes for Nevers in a game against the Chicago Bears in 1929 when Nevers scored six touchdowns.\n\nKiesling, who was named to the NFL's all-league team in 1929, 1930 and 1932, played in Pittsburgh from 1937-39.\n\nKiesling joined Johnny 'Blood' McNally to be a head coach in 1939 when the team was known as the Pirates, and continued in that role as the team changed their name to the Steelers in 1940. In 1942 Kiesling lead the Steelers to their first winning season in franchise history, finishing 7-4, while winning four of the last five games of the season and outscoring opponents 167-119. He co-coached the Pittsburgh-Philadelphia and Pittsburgh-Chicago Cardinals combined teams during World War II. Kiesling left coaching for a time after the 1944 season, but came back into the fold.\n\nKiesling returned in 1954 for a three-year stint with the Steelers. Although the team posted three losing seasons, with a combined 14-22 record, they earned a reputation for rugged, hard-hitting football, taking on Kiesling's personality. The one regret Kiesling might have had was when he released future Hall of Fame quarterback Johnny Unitas in 1955, after drafting him in the ninth round that same year. Unitas never played in a game, and the Pittsburgh native was released after training camp.\n\nDuring his 34 years in the NFL as a player, assistant coach and head coach, Kiesling left a big impact. He died in 1962 at the age of 58.",
    "stats": ""
  },
  {
    "player_name": "Jack Lambert",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/jack_lambert.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Pro Bowl: 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983 | Hall of Fame: 1990 | Hall of Honor: 2017",
    "trivia": "Jack Lambert was voted into the Pro Football Hall of Fame as a member of the Class of 1990. Lambert was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nHe was one of the most menacing linebackers ever to play in the NFL, known fondly as \"Jack Splat\" or \"Dracula in Cleats.\" When opposing players looked across the line, they would see the fierce look in his eyes, the intense glare, the missing teeth, and there were times they didn't want to take the snap.\n\n\"We're the Pittsburgh Steelers. We're supposed to be the intimidators,\" Lambert once said.\n\nAnd with Lambert leading the charge, they were. Lambert didn't take well to others trying to intimidate, and when it happened, there was a price to pay. In Super Bowl X Cowboys' safety Cliff Harris taunted Roy Gerela, patting him on the head following a missed field goal. Lambert didn't like it, and responded by body slamming Harris to the ground.\n\nRemember this is the guy who said this in regards to protecting quarterbacks: \"It might be a good idea to put dresses on all of them. That might help a little bit.\"\n\nLambert, the Steelers second-round pick in the legendary 1974 draft class, was special right off the bat, winning the starting middle linebacker job his rookie year and holding on to it for his 11-year career.\n\nHe won the NFL's Defensive Rookie of the year that season, and two years later was named the NFL's Defensive Player of the Year and became known as one of the premier linebackers of his era, with a combination of intelligence, intensity, speed and range.\n\nLambert was named to nine straight Pro Bowls, was All-Pro eight times, and a team defensive captain for eight years. He played in six AFC Championship games and was a member of the Steelers four Super Bowl winning teams in the 1970s.\n\nLambert had 28 career interceptions, including a pivotal one late in Super Bowl XIV that secured the win.\n\nKnown for his durability, Lambert missed only six games during his first 10 seasons, but his career came to an end after he suffered a serious toe injury in 1984.\n\nAnd just like he silenced opposing offenses, only Lambert could silence the fans at his Pro Football Hall of Fame induction.\n\nWith chants of \"Here We Go Steelers, Here We Go\" from the Steelers faithful, Lambert told them, \"Thank you, let's get this done.\"\n\nWith that, they were silent and Lambert began his speech, thanking those who made a difference in his life and career, including the coaches who meant the most to him. He also talked about what a special place Pittsburgh was and how much he loved playing for the Steelers.\n\n\"On the day I retired from pro ball, I made this statement; 'There is not an owner, or a team, or a coaching staff, or people in a city that I would rather have played for in the entire world,'\" said Lambert in his speech. \"The kindness that Arthur J. Rooney and his family have shown me over the years -- and the kindness that the people of Pittsburgh have shown me over the years -- are the kindnesses that I can never repay. Five years later, I appreciate and stand by these words even more.\n\n\"I was so fortunate to have played on some of the greatest teams of all time and arguably the greatest defense ever assembled. And finally, how fortunate I was to play for the Pittsburgh fans... a proud and hard-working people who love their football and their players.\n\n\"If I could start my life all over again, I would be a professional football player, and you damn well better believe I would be a Pittsburgh Steeler!\"",
    "stats": ""
  },
  {
    "player_name": "Bobby Layne",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/bobby_layne.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Pro Bowl: 1951, 1952, 1953, 1956, 1958, 1959 | Hall of Fame: 1967 | Hall of Honor: 2017",
    "trivia": "Bobby Layne was voted into the Pro Football Hall of Fame as a member of the Class of 1967. Layne was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nLayne was originally drafted by the Steelers, but traded to the Chicago Bears where he began his career in 1948. He went on to the New York Bulldogs in 1949, and the Detroit Lions from 1950-58. Layne was a two-time All-NFL selection and was the league's scoring champion in 1956 and set Lions records that stood for more than 50 years.\n\nFate brought Layne to the Steelers for the final years of his career, 1958-62, where he brought his leadership and competitiveness to a team that needed it. Lions coach Buddy Parker left the team in 1957 to coach the Steelers, and the following year the Steelers acquired Layne via a trade in October. The two combined for what would be the Steelers best year to date.\n\nIn his book, \"My 75 Years with the Steelers,\" Dan Rooney Sr. wrote about Layne's arrival in Pittsburgh after picking him up at the airport.\n\n\"He questioned me the whole way, wanting to know everything about the players, the coaches and the city,\" wrote Rooney. \"From the time his foot hit the ground on the field at South Park, Bobby Layne was in charge. He was that kind of guy, always in command.\"\n\nLayne expressed his desire to be a success when reporters first met him.\n\n\"I just hope I can do as well for Buddy as I did in Detroit,\" Layne told the reporters.\n\nIn his first full season with the Steelers Layne completed 142 passes for 1,986 yards and 20 touchdowns. He followed that with passing for 1,814 yards and 13 touchdowns in 1960, 1,205 yards and 11 touchdowns in just eight games in 1971 and 1,686 yards and nine touchdowns in 1962, his final season.\n\nLayne finished his amazing career with 1,814 completions for 26,768 yards and 196 touchdowns in 175 career games, but once stated his biggest disappointment in football was never winning a championship for Art Rooney Sr.\n\nLayne returned back to his home state of Texas after his career ended, where he died in 1986 at the age of 59.",
    "stats": ""
  },
  {
    "player_name": "John \"Blood\" McNally",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/john_blood_mcnally.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Hall of Fame: 1963 | Hall of Honor: 2017",
    "trivia": "John McNally was voted into the Pro Football Hall of Fame as a member of the Class of 1963. McNally was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nMcNally, nicknamed 'Blood,' played four seasons in Pittsburgh, including three when he was a player-coach, during a time when the team was known as the Pittsburgh Pirates.\n\nHe was considered a vagabond and one of the most colorful players of his time, adopting the name Blood from the movie, 'Blood and Sand,' that starred Rudolph Valentino. He used it not as a nickname, but an alias to forgo his final year of eligibility at St. John's College and play pro ball with the East 26th Street Liberties of Minneapolis.\n\nHe played 14 seasons with five different teams, and had two stints in Pittsburgh. He played in 1934 and then returned to finish out his career from 1937-39. In a day when players were asked to do it all, he did. He was one of the best wide receivers in the NFL during his time, but also played running back, could punt and also be used as quarterback. Oh yeah, and he also played defense.\n\n\"They pay me to score touchdowns,\" he was quoted as saying. \"The swagger I give 'em for free.\"\n\nHe played for the Green Bay Packers where he helped lead the team to three straight NFL Championships (1929-31) and a fourth in a second stint with the team in 1936.\n\nIn his first game back in Pittsburgh in 1937 he returned the opening kickoff 92 yards for a touchdown, but the team struggled during his years with just a 7-25-1 record.\n\n\"Some people have told me I'm really a frustrated priest,\" he once said. \"A psychiatrist told my mother I should have been an actor. But I found my niche in football. I have no doubt that's where I belong.\"\n\nHe died in 1985 at the age of 81.",
    "stats": ""
  },
  {
    "player_name": "Chuck Noll",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/chuck_noll.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Hall of Fame: 1993 | Hall of Honor: 2017",
    "trivia": "Chuck Noll was voted into the Pro Football Hall of Fame as a member of the Class of 1993. Noll was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nNoll, \"The Emperor,\" truly was the man who changed who the Pittsburgh Steelers were and continue to be.\n\nWhen he was hired in 1969, the Steelers were a team that had struggled to win in the past. Prior to Noll's arrival the Steelers had just eight winning seasons and had not won a championship. And even in his first season the team went just 1-13.\n\nBut it didn't take long for Noll to bring a culture of winning with his style of coaching, a style that was about teaching and developing a group of players who would soon become legends.\n\nUnder Noll the Steelers won four Super Bowl championships in a six-year span - Super Bowls IX, X, XIII and XIV.\n\nNoll led the Steelers to 15 winning seasons, nine division championships, and 12 playoff appearances, along with the four Super Bowl victories in the 1970s.\n\n\"As for the football end of it, I think he ranks with (George) Halas and (Vince) Lombardi,\" said Steelers Chairman Dan Rooney Sr. when Noll passed away in 2014. \"There are many other good coaches over the history of the NFL, but I think Chuck Noll ranks up there with those other two guys right at the top. No other coach won four Super Bowls, and the way he did it was with dignity. His players were always his concern, both in treating them well and giving them what they needed to succeed on the field.\"\n\nNoll won 209 games in his 23 seasons with the Steelers, and coached 11 Pro Football Hall of Fame players. And he did it in a manner that is not often seen in sports. He wasn't a rah-rah guy, as his players said he told them they shouldn't need that kind of motivation. He didn't yell and scream. He didn't high-five, hug or embrace players when they made a big play, because that's what he expected from them. But he cared about every player who put on a uniform and went out and played for him.\n\n\"Chuck was just the ultimate leader,\" said Hall of Fame defensive lineman Joe Greene and Noll's first-ever draft pick. \"He had truth and belief in what he was saying, and over time all of those things he said were validated, the things about winning football games and being a solid citizen.\n\n\"I do know having Chuck as a coach made all the difference in the world in having the career that I had as a Pittsburgh Steeler. I know that early on we went 1-13, and even the year after, when you aren't having success, it's just hard to put any belief in the coach. After a while when nothing is happening positive for you, I was one of those of those guys who said what we are doing isn't working. Why shouldn't we change? But Chuck never changed. We just got better players and followed his instructions better. That's when I became a believer. Somewhere around the third year I started to see that if we did what he said, then we would win. And if we didn't do it then we wouldn't win. And I became a believer, even before we started to win. I saw the consistency in him and became a believer because of what he said and it became clear that how he was coaching us was the right way. In my time I didn't see him hug a player or embrace a player, but he still loved his players. He wasn't one for showing those kinds of emotions. But I watched him, and I saw him show his appreciation for his players and for his team in a very quiet and subtle way.\"\n\nNoll was a humble man, one who would rather talk about his love of flying than football, and one who never took credit for the success he brought to the Steelers, even when he was inducted into the Hall of Fame.\n\n\"The single most important thing we had in the Steelers of the 1970s was an ability to work together,\" said Noll during his acceptance speech. \"The thing that stuck out was we had a lot of people who didn't worry about what somebody else did. If someone else was having a tough time on a particular day, they reached down and got it up a little more. They got the thing done. Whatever they had to do, they did to win. There was never a reason to let down.\n\n\"Right now you hear about teamwork and it's defined as 50-50, and that is a falsehood. There's no such thing as 50-50. You do whatever you have to do as part of the team. You may have to carry somebody.\n\n\"I can't tell you how much you gain, how much progress you can make, by working together as a team, by helping one another. You get much more done that way. If there's anything the Steelers of the '70s epitomized, I think it was that teamwork.\"",
    "stats": ""
  },
  {
    "player_name": "Bill Nunn",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/bill_nunn.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV, XL, XLIII | Hall of Honor: 2018 | Hall of Fame: 2021",
    "trivia": "Bill Nunn was inducted into the Steelers Hall of Honor as a member of the Class of 2018.\n\nBefore accepting Dan Rooney's job offer in 1968, Bill Nunn was a newspaper guy – first a sports writer, then the sports editor, then the managing editor of The Pittsburgh Courier during an era when it was one of the most influential black publications in America. Starting in 1950, Nunn personally selected the annual Black College All-America Football Team for The Pittsburgh Courier, and in the course of performing that duty he developed relationships with players and coaches at those colleges that would serve him well during his career in the NFL. Before the rest of the league caught on to the wealth of talent available in the programs at the Historically Black Colleges, Nunn helped the Steelers add many players who would go on to fill integral roles in the four Super Bowl championship teams of the 1970s. Included among those were L.C. Greenwood from Arkansas AM&N, Mel Blount from Southern, Frank Lewis from Grambling State, Dwight White from Texas A&M-Commerce, Ernie Holmes from Texas Southern, Joe Gilliam from Tennessee State, John Stallworth from Alabama A&M, and Donnie Shell from South Carolina State. For his decades of service, Nunn was enshrined as a member of the Inaugural Class of the Black College Football Hall of Fame.",
    "stats": ""
  },
  {
    "player_name": "Troy Polamalu",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/troy_polamalu.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: XL, XLIII | Pro Bowl: 2004, 2005, 2006, 2007, 2008, 2010, 2011, 2013 | AP Defensive Player of the Year: 2010 | Hall of Honor: 2020 | Hall of Fame: 2020",
    "trivia": "Troy Polamalu is a member of Steelers Hall of Honor as a member of the Class of 2020. Polamalu is also a member of the Pro Football Hall of Fame Class of 2020.\n\n\"If you don't know where Troy Polamalu is,\" said Patriots coach Bill Belichick, \"he'll kill you.\" The Houston Texans got a live example during a 2005 game when Polamalu recorded three sacks, one of which came when he walked up to the line, then turned his back to the line of scrimmage in an apparent move to get back into coverage, only to pivot at the snap of the ball and find a lane to quarterback David Carr. \"I mean, every time I looked up, it seemed like No. 43 was in my face,\" said Carr, who was sacked eight times that afternoon. The 16th overall pick of the 2003 draft, Troy Polamalu and Ed Reed became the first two players named whenever the subject was big-play safeties in the NFL. In two separate meetings with Peyton Manning and the Indianapolis Colts in 2005, Polamalu had an interception in each game, even though the one in the playoffs was ruled incomplete by referee Peter Morelli. In his 12 NFL seasons, Polamalu finished with 32 interceptions, 12 sacks, seven fumble recoveries, and 107 passes defensed. He was voted first-team All-Pro four times, won the 2010 Defensive Player of the Year Award, and he was voted into the Pro Football Hall of Fame in his first year of eligibility as a member of the Class of 2020.",
    "stats": ""
  },
  {
    "player_name": "Art Rooney Sr.",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/art_rooney_sr.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Hall of Fame: 1964 | Hall of Honor: 2017",
    "trivia": "Art Rooney Sr. was voted into the Pro Football Hall of Fame as a member of the Class of 1965. Rooney was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nHe wasn't the first in the Steelers organization to be inducted into the Pro Football Hall of Fame, and that is just how Rooney would have wanted it.\n\nIn his mind, the players and coaches always came first, and Rooney would happily remain in the background, giving credit to those around him.\n\nEven when the Steelers won Super Bowl IX, their first of four after 40 years of fighting for a championship, the man affectionately known as 'The Chief,' didn't even want to be in the spotlight.\n\n\"I made him come up on the stage,\" recalled linebacker Andy Russell. \"He was standing in the background like an onlooker. I told him 'Chief come up, it's your team.' He came up and we all hugged him. It was a great moment.\n\n\"It was very sweet. He was such an amazing guy. He would come out rain or snow and be out there watching practice. He would be right out there in the cold with us. After practice he would be in locker room talking to players. It was like a family and he was the best.\"\n\nRooney exemplified what the Pittsburgh Steelers were about from the time he founded the organization on July 8, 1933 and throughout the glory years of the 1970s when the team won four Super Bowl championships.\n\n\"The highlight from Super Bowl IX was watching 'The Chief' get the trophy,\" said former safety Mike Wagner. \"He was known as the good guy owner, a wonderful man. He would try and touch every player in a personal way. He always had something good to say, he was interested in you. We knew the number of years the team had been a loser. The move to bring Dan (Rooney) in and let him run the day to day business and to hire Chuck (Noll) was great.\n\n\"But at the end of the day it was all about 'The Chief', it was his dream, his vision.\"\n\nRooney was a driving force behind the NFL-AFL merger, and kept the Steelers franchise viable during the depression, World War II and other tough times, even merging with the Philadelphia Eagles in 1943 and Chicago Cardinals in 1944 during the war.\n\n\"He was a man who belonged to the entire world of sports,'\" said former NFL Commissioner Pete Rozelle. \"It is questionable whether any sports figure was more universally loved and respected.\"\n\nRooney, who was presented for his Hall of Fame induction by former Pennsylvania Governor David Lawrence, handled his day in Canton with the same grace and humble approach he handled everything in life.\n\n\"I am indebted and grateful to the men that chose me for this great honor,\" said Rooney. \"To the people of Pittsburgh and all the sports fans everywhere, I owe my thanks. To the men in cities and towns that pioneered professional football, both promoters and players alike that will never receive this honor, all of us who are a part of the game today are indebted and owe our thanks. May God bless and keep them.\"\n\nArt Rooney Sr. died on Aug. 25, 1988 at the age of 87.",
    "stats": ""
  },
  {
    "player_name": "Daniel M. Rooney",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/daniel_m._rooney.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV, XL, XLIII | Hall of Fame: 2000 | Hall of Honor: 2017",
    "trivia": "Daniel M. Rooney was voted into the Pro Football Hall of Fame as a member of the Class of 2000. Rooney was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nThere aren't many Pro Football Hall of Famers that are inducted one day, and then back to work for what they were inducted for the next day. But there also aren't many Hall of Famers like Rooney.\n\nRooney was one of the NFL's most influential owners and a pivotal figure in the growth and development of the league.\n\nThroughout the years Rooney was been a member of the board of directors for the NFL Trust Fund, NFL Films, and the Scheduling Committee. He was appointed Chairman of the League's Expansion Committee in 1973, eventually adding Seattle and Tampa Bay to the NFL in 1976.\n\nRooney was named Chairman of the Negotiating Committee in 1976, and in 1982 he contributed to the negotiations for the Collective Bargaining Agreement for NFL owners and the Players Association. He brought a calm, reasonable approach to labor relations, and was a driving force in the labor agreement again in 1993. Rooney has also been a member of the Management Council Executive Committee, the Hall of Fame Committee, the NFL Properties Executive Committee, and the Player/Club Operations Committee. He served as the President of the Steelers from 1975 until 2003, when he turned it over to his son, Art Rooney II, and became the Chairman until his passing.\n\nRooney chose one of his Hall of Fame players, Joe Greene, to be his presenter for the Hall of Fame, a man he was close to as a player and still is today.\n\n\"When I was a young player, Dan often had to steer me in the right direction,\" said Greene. \"In my youthful exuberance to win, I was in everybody's business. I was always attempting to tell the coaches what plays to call, and telling the players how to play the game. I even had the nerve to tell Dan he needed to get a player signed.\n\n\"Whenever I've had a special occasion in my life, the times you want your friends to share, Dan or a member of his family has been there. That means an awful lot. Dan has not only exhibited kindness towards me, but has followed in his father's footsteps. All the Steelers players are a part of his family. I am most honored and proud to represent the Rooney family, the Steelers organization, all the former players and coaches, the City of Pittsburgh, and the fans presenting our boss and our friend to the Pro Football Hall of Fame, Dan Rooney.\"\n\nRooney then did what he always does when he deflected credit away from himself and put it on to others.\n\n\"The players and coaches made the Steelers, and I attribute my presence here today to all of them and to my father,\" said Rooney in his speech. \"My father (Art Rooney Sr.), one of the early men who did everything to make the NFL succeed, it is special to join him here. He gave me the understanding of what the league meant. He gave me the commitment to do everything possible to keep it strong and viable.\"\n\nAnd then he encouraged everyone who loves the game of football to do their part to continue its growth and protect it.\n\n\"I ask you to be watchful, see that the game remains the best, strong, viable, and flexible for the present day,\" said Rooney. \"No one can be more interested than youth. You have much to guide you. Your own commitment and how you played the game. The people in the league, players, coaches, owners, staff, and fans; the television networks, our family, our players, you have my commitment to do whatever it takes. The National Football League, the game is your legacy. Protect it. Don't let anyone tarnish it.\"\n\nAfter his induction into the Hall of Fame Rooney did what he asked others to do, protect the NFL. He created the Rooney Rule in 2003, which required NFL teams to interview a minority candidate for head coaching and senior football operation jobs.\n\nRooney also served as the United States Ambassador to Ireland.",
    "stats": ""
  },
  {
    "player_name": "Donnie Shell",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/donnie_shell.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Pro Bowl: 1978, 1979, 1980, 1981, 1982 | Hall of Honor: 2017 | Hall of Fame: 2020",
    "trivia": "Donnie Shell was an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017. Shell is also a member of the Pro Football Hall of Fame Class of 2020.\n\nEarl Campbell was a 233-pound running back by trade, and inflicting pain was part of his business. In 1978, Campbell would finish with 1,450 yards, a 4.8 average and 13 touchdowns, but on Dec. 3 with the division title at stake, he met his match in Donnie Shell. In the first quarter, Campbell was spinning out of a tackle trying to get extra yards, when the man nicknamed \"Torpedo\" came flying up to the line of scrimmage and delivered a blow that could be heard in the upper reaches of the Astrodome. Campbell left the game with a broken rib, and the Steelers beat the Oilers, 13-3, in a season that ended with the third Super Bowl championship in team history. Shell was an undrafted rookie in 1974 because he played linebacker at South Carolina State, but through hard work and dedication he made himself into an All-Pro who finished his career with 51 interceptions, still the most in NFL history for a strong safety. Shell was a five-time Pro Bowl player, who had at least one interception in each of his 14 NFL seasons.",
    "stats": ""
  },
  {
    "player_name": "John Stallworth",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/john_stallworth.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XII, XIV | Pro Bowl: 1979, 1982, 1984 | Hall of Fame: 2002 | Hall of Honor: 2017",
    "trivia": "John Stallworth was voted into the Pro Football Hall of Fame as a member of the Class of 2002. Stallworth was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nStallworth, the Steelers fourth-round selection in the historic Steelers 1974 NFL Draft class, caught 537 passes for 8,723 yards and 63 touchdowns, all Steelers team records at the time of his retirement. He also scored one rushing touchdown.\n\nHe played in six AFC championship games and was a part of the Steelers four Super Bowl championships and was named team MVP twice. Stallworth was named All-Pro in 1979, All-AFC in 1979 and 1984 and played in four Pro Bowls. He had 12 postseason touchdown catches and 17-consecutive postseason games with a reception.\n\nStallworth scored the game winning touchdown on a 73-yard reception in Super Bowl XIV against the Los Angeles Rams. Stallworth still holds the Super Bowl record for average yard per catch with 24.4 yards. He also holds the record for single-game average, 40.33 yards, set in Super Bowl XIV. Swann is second in that category with a 40.25 yard average from Super Bowl X, and Stallworth third with a 38.33 yard average in Super Bowl XIII.\n\nDuring his Hall of Fame acceptance speech Stallworth talked about his first impression of Pittsburgh when he arrived in 1974, and how that changed after the Steelers won Super Bowl IX.\n\n\"I've learned that first impressions are not always correct. My first day in Pittsburgh was a mid-winter night right after the draft. It was cold, the trees were barren, it was snowing and I didn't bring a big coat from Alabama. I don't think I owned a big coat.\n\n\"And I was going to a team that didn't seem to be terribly thrilled about throwing the football, the kiss of death for a receiver. My first impression of that situation was this is not a good thing.\n\n\"Eight months later, I arrived at the airport and caravanned into Pittsburgh after our first Super Bowl win. It was cold. The trees were equally as barren. It was snowing. As a matter of fact, it had been snowing for several days.\n\n\"But the difference was there were the people. They were lining the highway from the airport all the way to the city, easily a 20-minute drive. You would have thought it was mid-summer.\n\n\"And I came away from that experience with a deep appreciation of the people of Western Pennsylvania. I thank you. I thank you, the people of Western Pennsylvania, for making a Southern boy feel at home for 14 years.\"\n\nStallworth is currently a member of the Steelers ownership group.",
    "stats": ""
  },
  {
    "player_name": "Ernie Stautner",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/ernie_stautner.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Pro Bowl: 1952, 1953, 1955, 1956, 1957, 1958, 1959, 1960, 1961 | Jersey Retired: 1964 | Hall of Fame: 1969 | Hall of Honor: 2017",
    "trivia": "Ernie Stautner was voted into the Pro Football Hall of Fame as a member of the Class of 1969. Stautner was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nStautner was the first player ever to have his number retired by the Pittsburgh Steelers, and it was well earned as he was the first of their Hall of Famers to play his entire career with the team. The team's second-round draft pick in 1950, Stautner's No. 70 was retired in 1964, a deserving honor for a legend.\n\nStautner won the NFL's Best Lineman Award in 1957 and he earned All-NFL honors nine times, despite being considered undersized. He missed just six games during his 14-year career, never letting numerous injuries slow him down.\n\n\"That man ain't human. He's too strong to be human,\" Jim Parker, the Hall of Fame offensive guard for the Baltimore Colts once said. \"He's the toughest guy in the league to play against because he keeps coming headfirst. Swinging those forearms wears you down.\n\n\"That animal used to stick his head in my belly and drive me into the backfield so hard that when I picked myself up and looked around, there was a path chopped through the field like the farmer had run a plow over it.\"\n\nStautner, who was named to nine Pro Bowls, chose Art Rooney Sr. to be his presenter at the Hall of Fame.\n\n\"For 14 years, Ernie was not only Pittsburgh's greatest lineman, but one of the greatest linemen in professional football,\" said Rooney during his introduction. \"For nine years he was chosen for the all-pro game and then I was trying to recollect in the 14 years that he played for us had he ever missed a game and I can't remember him ever missing a game.\n\n\"Not only did Ernie play defensive football for us but many times when the going got rough, which was often, he played offense too. He's been a credit to all athletes, and certainly been a credit to professional sports.\"\n\nA humble and happy Stautner, thanked Rooney and talked about how special an honor being elected to the Hall of Fame was.\n\n\"Little did I really know then that football, with all the pains and mental anguish that go with it, would bring me such great personal pride and pleasure,\" said Stautner in his speech. \"It truly surpasses all my dreams and expectations. To be selected to Professional Football's Hall of Fame happens to very few and I feel extremely proud to be one of those chosen.\n\n\"You know no one receives such a distinctive honor through their efforts alone. In my case, it was greatly through the efforts of my great owner, Mr. Rooney, my coaches who taught me well, my family who encouraged me, and my opponents who realistically made me work but particularly because of my teammates of the Pittsburgh Steelers that I am here.\"\n\nStautner, who was born in Germany, died in 2006 at age 80.",
    "stats": ""
  },
  {
    "player_name": "Lynn Swann",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/lynn_swann.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Pro Bowl: 1975, 1977, 1978 | Hall of Fame: 2001 | Hall of Honor: 2017",
    "trivia": "Lynn Swann was voted into the Pro Football Hall of Fame as a member of the Class of 2001. Swann was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nSwann was proof that good things come to those who wait, and his wait had to have seemed like an eternity. It took 14 years for the former Steelers wide receiver to get the call from the Hall of Fame, but it was worth the every minute of it.\n\n\"Waiting is always tough,\" said Swann, recently recalling his induction day. \"Football players are accustomed to being hands on. For a player to have to wait and there is nothing you can do, it's like sitting on the bench and your team is out there playing. It's the Super Bowl and you are not on the field. You want to hoist the trophy and there is nothing you can do. It's excruciating for an athlete to be on that sideline.\n\n\"The 14 years of being on that list, being on the finalist list, making it seemed to erase it all. It was like the first day I was eligible, you go in. You are thrilled to join the Steelers who are in the Hall of Fame. You are thrilled and excited about that kind of recognition.\n\n\"It's almost post-Super Bowl excitement. It's something you don't earn overnight. It's something that takes time to get in, takes a high degree of consistency to get in. Even though it's an individual honor, it's a team that puts you in there. Without the whole team no individual has a chance to showcase their individual talent to make that happen.\"\n\nSwann, the first-round draft pick in the legendary 1974 Steelers draft class, had plenty of opportunities to show his individual talent. Known for his graceful moves and leaping catches, Swann always came through on the big stage.\n\nSwann, who suffered a concussion in the 1975 AFC Championship Game, was an uncertainty to be ready for Super Bowl X. But Swann was ready to go come game day, and then some.\n\nHe had four receptions for 161 yards and a 64-yard touchdown. But you have to see the highlight reel to truly appreciate the greatness of what he did, as the receptions are legendary footage for NFL Films courtesy of his circus catch and leaping ability. He went on to win MVP honors for his performance.\n\n\"My big catches that day are what people remember,\" said Swann. \"But in coming back from my concussion, my biggest catch occurred on the first pass that Terry threw to me. I went up for a high, graceful reception that gave me the confidence I needed to make the other catches later on.\"\n\nSwann finished his career with 336 receptions for 5,462 yards and 51 touchdowns, and a highlight reel that would make any receiver envious.\n\n\"I'd like to say that we developed Lynn Swann,\" said his late Coach Chuck Noll. \"But the truth is he was perfectly developed as a football player the first time he stepped on our practice field.\"\n\nSwann was named All-Pro and selected to the Pro Bowl in 1975, 1977 and 1978, and was named to the NFL's All-Decade Team of the 1970s and the Super Bowl Silver Anniversary Team.\n\nSwann, who was part of the final class to be inducted on the actual steps of the Hall of Fame, will never forget that special day.\n\n\"I could not be here without the overwhelming support of Dan Rooney and Chuck Noll,\" said Swann during his induction speech. \"I know that last year when Dan Rooney stood here at this podium as proud as he was to be following in his father's footsteps, who also stood here and accepted the award of being inducted into the Hall of Fame. I am happy that he is sitting behind me, to share in this day, to know that I fully appreciate all that he has done. And to Chuck Noll, for his unwavering support in saying that I belong here on the steps of Canton, and giving me the opportunity to play this football game.\n\n\"The virtuous part of having this patience also means that the day I was selected to the Hall of Fame this last January couldn't have been a better day because it would have been the 100th anniversary of the birth of Art Rooney, Sr., the founder of this football team.\"",
    "stats": ""
  },
  {
    "player_name": "Mike Webster",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/mike_webster.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Super Bowl: IX, X, XIII, XIV | Pro Bowl: 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1987 | Hall of Fame: 1997 | Hall of Honor: 2017",
    "trivia": "Mike Webster was voted into the Pro Football Hall of Fame as a member of the Class of 1997. Webster was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nWhen you talk about the center position for the Pittsburgh Steelers, the conversation always starts with Webster. A fifth-round draft pick by the team in the 1974 NFL Draft, Webster anchored the Steelers line throughout his career.\n\nWebster started 150 consecutive games, beginning at the end of the 1975 season and lasting until 1986, when a dislocated elbow sidelined him for four games.\n\nWebster played 15 seasons and 200 games with the Steelers, more than any other player in team history at the time of his retirement, although passed by Ben Roethlisberger in 2020. He spent his last two seasons (1989-90) with the Kansas City Chiefs.\n\nHe was the Steelers offensive captain for nine seasons, a strong leader off the field and the strongest player on the field, earning him the nickname \"Iron Mike.\"\n\n\"Mike wasn't tall enough, he didn't weigh enough, but the thing he had that made the difference was he had great playing strength,\" said late Hall of Fame Coach Chuck Noll. \"You could see it on the field. He would come off the ball with great quickness. I can remember having some films of him against I think it was UCLA, which had these huge, huge tackles. He just destroyed him. Wisconsin moved the ball up and down the field. He not only blocked well on the run, but he also pass protected well.\"\n\nWebster, a member of the Steelers four Super Bowl championship teams in the 1970s, played in nine Pro Bowls, and was selected All-Pro seven times.\n\nWebster led the way for Hall of Fame running back Franco Harris, and kept quarterback Terry Bradshaw safe. It was Bradshaw who would be Webster's Hall of Fame presenter, and the two shared a special moment on the steps in Canton, Ohio.\n\nAs Bradshaw talked about a dream he had as a kid to play on a championship team, he rattled off the Steelers players that helped him achieve that. When he got to center, he spoke of Webster.\n\n\"What good is a machine if you ain't got a center? And, oh, did I get a center,\" said Bradshaw. \"I just didn't get any center. I got the best to ever play the game, to ever put his hands on a football. And I said `Make sure he ain't as pretty as me,' and he ain't.\"\n\nAnd then Bradshaw fulfilled another dream, the one he had the day he was inducted into the Hall of Fame in 1989, when he said, \"Oh, what I would give to put my hands under Mike Webster's butt one more time.\"\n\nSo on the day Webster was inducted, Bradshaw pulled a football from underneath the podium and as the moment happened, Steelers fans, fellow Hall of Famers, and everyone in Canton erupted. Bradshaw took one last snap from Webster.\n\n\"Do not be afraid to fail,\" Webster told the gathered crowd that day. \"You're going to fail, believe me. No one's keeping score. All we have to do is finish the game. Then we'll all be winners.\"\n\nFive years after his induction, Webster died at the age of 50.",
    "stats": ""
  },
  {
    "player_name": "Rod Woodson",
    "number": null,
    "position": "",
    "group": "HOF",
    "image": "fetchimages/hofimages/rod_woodson.jpg",
    "info": "Draft: Undrafted",
    "career": "",
    "achievements": "Pro Bowl: 1989, 1990, 1991, 1992, 1993, 1994, 1996, 1999, 2000, 2001, 2002 | Hall of Fame: 2009 | Hall of Honor: 2017",
    "trivia": "Rod Woodson was voted into the Pro Football Hall of Fame as a member of the Class of 2009. Woodson was also an inaugural member of the Steelers Hall of Honor as a member of the Class of 2017.\n\nThere are not many first-ballot Hall of Fame selections. Often players have to wait for years for their day in the spotlight to arrive. But for Woodson, it took just one year of eligibility for the Hall of Fame selection committee to deem him worthy of a Gold Jacket.\n\nWoodson played 17 seasons in the NFL, 10 of them with the Steelers. He also played for the San Francisco 49ers (1997), Baltimore Ravens (1998-2001) and Oakland Raiders (2002-03).\n\n\"It's definitely an honor and a privilege to be in the Pro Football Hall of Fame,\" said Woodson shortly before his induction in 2009. \"I've looked at my life and thought about how long the National Football League has been around, really how long pro football has been going on, and to be inducted and be one of 200-some guys in the Pro Football Hall of Fame, I think it's amazing. I look at myself, this country boy from Indiana, and really it's hard for me to believe that I'm a Hall of Famer, to put myself in that category, it's definitely a privilege.\n\n\"The pinnacle of any professional football player's career is to be inducted into the Pro Football Hall of Fame and I'm definitely honored and humbled.\"\n\nWoodson was the Steelers first-round draft pick in 1987, and finished his illustrious career with 71 interceptions that he returned a total of 1,483 yards, including 12 of them for touchdowns. Woodson finished his career with 4,894 kickoff return yards, 2,362 punt return yards and five touchdowns on returns – two punts, two kickoffs and one fumble.\n\nHe was named to the Pro Bowl 11 times, selected as a cornerback, safety and a kick returner.\n\n\"He was something special as an athlete,\" said Hall of Fame Coach Chuck Noll, who drafted Woodson. \"He had the great speed and the size.\"\n\nWoodson earned NFL Defensive Player of the Year honors for his performance in 1993 when he recorded eight interceptions, returning one for a touchdown, 28 passes defensed, two forced fumbles and two sacks. Woodson, who had 38 interceptions with the Steelers, was named team MVP three times.\n\nHe was one of only five active players named to the NFL's 75th Anniversary Team in 1994, and was also a member of the Steelers' 75th Anniversary All-Time Team.\n\nOn the day he was inducted into the Pro Football Hall of Fame, Woodson praised his former Steelers coaches and teammates, and talked about how special it was to play for the black and gold and even thanked the fans for booing him.\n\n\"I just want to say thank you to the Rooney family, great, great family. Arguably one of the best or the best sporting franchise in all of sports because of the family. I want to say thank you for giving me 10 wonderful years there.\n\n\"To the Steelers Nation thank you for accepting me, for cheering me on and after I left for booing me. I'm serious for booing me. Because you know, if you cheered me when I put on a Raiders uniform or a Ravens uniform, I think I would have lost a little respect for the Steelers Nation. So I'm glad you booed me, because you should.\"",
    "stats": ""
  }
]