{
  "8439": {
    "paragraph": "His 14 seasons with 3,500 passing yards or more ranks tied for third in NFL history. Named NFC Player of the Month 10 times in his career (December in 2021, December of 2020, December of 2016, November of 2014, October of 2012, November of 2011, October of 2011, September of 2011, December of 2010 and October of 2009). One of six quarterbacks in NFL history to register 150 regular-season wins as a starter. Born in Chico, California.",
    "selectedStrings": [
      "His 14 seasons with 3,500 passing yards or more ranks tied for third in NFL history",
      "Named NFC Player of the Month 10 times in his career (December in 2021, December of 2020, December of 2016, November of 2014, October of 2012, November of 2011, October of 2011, September of 2011, December of 2010 and October of 2009)",
      "One of six quarterbacks in NFL history to register 150 regular-season wins as a starter",
      "Born in Chico, California"
    ],
    "debug": {
      "playerId": "8439",
      "playerName": "Aaron Rodgers",
      "categoriesFound": [
        "2024",
        "PRO CAREER",
        "PERSONAL"
      ],
      "totalUniqueFacts": 117,
      "duplicatesRemoved": 7,
      "blanksSkipped": 0,
      "selectedCount": 4,
      "selectedChars": 432,
      "thresholdUsed": 0.6
    }
  },
  "12345": {
    "paragraph": "",
    "selectedStrings": [],
    "debug": {
      "playerId": "12345",
      "playerName": null,
      "categoriesFound": [],
      "totalUniqueFacts": 0,
      "duplicatesRemoved": 0,
      "blanksSkipped": 0,
      "selectedCount": 0,
      "selectedChars": 0,
      "thresholdUsed": null
    }
  },
  "13977": {
    "paragraph": "His 88.5 career sacks are the eighth-most by a defensive tackle in League history. His 58 passes defensed are the most among active NFL defensive tackles. Registered 718 tackles (439 solo), 199 quarterback hits, 133 tackles for loss, 88.5 sacks, 58 passes defensed, eight forced fumbles, seven fumble recoveries and two interceptions in his 14-year career. The Steelers are 14-0-1 when he has a multi-sack game and 12-0-1 when he has at least 2.0 sacks.",
    "selectedStrings": [
      "His 88.5 career sacks are the eighth-most by a defensive tackle in League history",
      "His 58 passes defensed are the most among active NFL defensive tackles",
      "Registered 718 tackles (439 solo), 199 quarterback hits, 133 tackles for loss, 88.5 sacks, 58 passes defensed, eight forced fumbles, seven fumble recoveries and two interceptions in his 14-year career",
      "The Steelers are 14-0-1 when he has a multi-sack game and 12-0-1 when he has at least 2.0 sacks"
    ],
    "debug": {
      "playerId": "13977",
      "playerName": "Cameron Heyward",
      "categoriesFound": [
        "2024",
        "PRO CAREER",
        "PERSONAL"
      ],
      "totalUniqueFacts": 43,
      "duplicatesRemoved": 27,
      "blanksSkipped": 0,
      "selectedCount": 4,
      "selectedChars": 449,
      "thresholdUsed": 0.6
    }
  },
  "15863": {
    "paragraph": "Named first-team All-Pro by the Associated Press in 2017. His father, Darius Sr., calls him \"Junior\". Made NFL starting debut in Week 1 of 2013 (vs. Minnesota). Led Philadelphia No. 1 pass defense and contributed to the Eagles owning the NFL's No. 1 total defense, en route to a Super Bowl LIX victory. Has played in 177 regular-season games (167 starts) over his 12-year NFL career (Detroit 2013-19; Phildelphia 2020-24).",
    "selectedStrings": [
      "Named first-team All-Pro by the Associated Press in 2017",
      "His father, Darius Sr., calls him \"Junior\"",
      "Made NFL starting debut in Week 1 of 2013 (vs. Minnesota)",
      "Led Philadelphia No. 1 pass defense and contributed to the Eagles owning the NFL's No. 1 total defense, en route to a Super Bowl LIX victory",
      "Has played in 177 regular-season games (167 starts) over his 12-year NFL career (Detroit 2013-19; Phildelphia 2020-24)"
    ],
    "debug": {
      "playerId": "15863",
      "playerName": "Darius Slay",
      "categoriesFound": [
        "PRO CAREER",
        "PERSONAL"
      ],
      "totalUniqueFacts": 22,
      "duplicatesRemoved": 10,
      "blanksSkipped": 0,
      "selectedCount": 5,
      "selectedChars": 417,
      "thresholdUsed": 0.6
    }
  }
}