{
  "8439": {
    "player_name": "Aaron Rodgers",
    "player_url": "https://www.steelers.com/team/players-roster/aaron-rodgers",
    "player_id": "8439",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nCAREER REGULAR-SEASON RECORD AS A STARTER: 153-87-1 (.637): 0-0 (.000) IN '05, 0-0 (.000) IN '06, 0-0 (.000) IN '07, 6-10 (.375) IN '08, 11-5 (.688) IN '09, 10-5 (.667) IN '10, 14-1 (.933) IN '11, 11-5 (.688) IN '12, 6-3 (.667) IN '13, 12-4 (.750) IN '14, 10-6 (.625) IN '15, 10-6 (.625) IN '16, 4-3 (.571) IN '17, 6-9-1 (.406) IN '18, 13-3 (.813) IN '19, 13-3 (.813) IN '20, 13-3 (.813) IN '21, 8-9 (.471) IN '22, 1-0 (1.000) IN '23 AND 5-12 (.294) IN '24\nHAS PLAYED IN 248 REGULAR-SEASON GAMES (241 STARTS) OVER HIS 20-YEAR NFL CAREER (GREEN BAY 2005-22; N.Y. JETS 2023-24)\nHIS 248 REGULAR-SEASON GAMES PLAYED ARE THE SIXTH-MOST AT QUARTERBACK IN NFL HISTORY\nHIS 241 REGULAR-SEASON GAMES STARTED ARE THE SIXTH-MOST AT QUARTERBACK IN NFL HISTORY\nHAS COMPLETED 5,369-OF-8,245 PASSES (65.1%) FOR 62,952 YARDS, 503 TDS, 116 INTERCEPTIONS AND A 102.6 CAREER PASSER RATING\nHAS RUSHED FOR 3,573 YARDS AND 35 TDS ON 741 CARRIES (4.8 AVG.)\nNAMED ASSOCIATED PRESS NFL MOST VALUABLE PLAYER FOUR TIMES (2011, 2014, 2020, 2021), JOINING PEYTON MANNING (FIVE) AS THE ONLY PLAYERS IN NFL HISTORY WITH FOUR OR MORE MVP AWARDS": []
    }
  },
  "13977": {
    "player_name": "Cameron Heyward",
    "player_url": "https://www.steelers.com/team/players-roster/cameron-heyward",
    "player_id": "13977",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nTEN-TIME TEAM CAPTAIN (2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024)\nSEVEN-TIME PRO BOWLER (2017, 2018, 2019, 2020, 2021, 2022, 2024)\nFOUR-TIME ASSOCIATED PRESS FIRST-TEAM ALL-PRO (2017, 2019, 2021, 2024)\nNAMED ASSOCIATED PRESS SECOND-TEAM ALL-PRO IN 2020\nNAMED THE 2023 WALTER PAYTON MAN OF THE YEAR, AN AWARD THAT RECOGNIZES A PLAYER'S OFF-THE-FIELD COMMUNITY SERVICE AS WELL AS HIS PLAYING EXCELLENCE\nSIX-TIME STEELERS' WALTER PAYTON MAN OF THE YEAR NOMINEE (2015, 2017, 2018, 2021, 2022, 2023)\nTHREE-TIME RECIPIENT OF THE PRO FOOTBALL WRITERS' \"THE CHIEF AWARD\" (2014, 2019 AND 2021), WHICH WAS ESTABLISHED IN HONOR OF THE STEELERS' FOUNDER, ARTHUR J. ROONEY, SR., AND IS PRESENTED ANNUALLY TO THE STEELER THAT BEST EXEMPLIFIES THE SPIRIT OF COOPERATION WITH THE MEDIA\nJOINED JOE GREENE (FOUR TIMES) AS THE ONLY INTERIOR DEFENSIVE LINEMEN (DT-NT) IN FRANCHISE HISTORY TO BE VOTED ASSOCIATED PRESS FIRST-TEAM ALL-PRO MORE THAN ONCE\nHIS FOUR AP FIRST-TEAM ALL-PROS ARE TIED FOR THE FIFTH MOST AMONG ALL ACTIVE NFL PLAYERS.\nHIS SEVEN PRO BOWLS RANK SECOND-MOST AMONG ACTIVE DEFENSIVE LINEMEN.\nHIS 88.5 CAREER SACKS ARE THE MOST BY A STEELERS' DEFENSIVE LINEMAN SINCE 1982\nHIS 88.5 CAREER SACKS ARE TIED FOR THE SECOND-MOST BY A STEELER SINCE 1982\nHIS 88.5 CAREER SACKS ARE THE MOST BY AN ACTIVE NFL DEFENSIVE TACKLE\nHIS 88.5 CAREER SACKS ARE THE EIGHTH-MOST BY A DEFENSIVE TACKLE IN LEAGUE HISTORY\nONLY DEFENSIVE LINEMAN IN FRANCHISE HISTORY WITH 8.0 OR MORE SACKS IN AT LEAST SIX SEASONS (2017, 2018, 2019, 2021, 2022, 2024) AND 10.0 OR MORE SACKS IN AT LEAST THREE SEASONS (2017, 2021, 2022)\nHIS THREE SEASONS OF 10.0 OR MORE SACKS AND SEVEN SEASONS OF 7.0 OR MORE SACKS ARE BOTH TIED FOR FOURTH-MOST BY A DEFENSIVE TACKLE SINCE 1982\nHAS PLAYED IN 211 GAMES (176 STARTS) OVER HIS 14-YEAR NFL CAREER (PITTSBURGH 2011-24)\nHIS 211 REGULAR-SEASON GAMES PLAYED FOR THE STEELERS ARE THE MOST AMONG DEFENSIVE PLAYERS AND FOURTH-MOST AMONG ALL PLAYERS (BEN ROETHLISBERGER - 249, MIKE WEBSTER - 220, HINES WARD - 217)\nHIS 211 REGULAR-SEASON GAMES PLAYED FOR THE STEELERS RANKS 12TH IN NFL HISTORY AMONG DEFENSIVE TACKLES\nREGISTERED 718 TACKLES (439 SOLO), 199 QUARTERBACK HITS, 133 TACKLES FOR LOSS, 88.5 SACKS, 58 PASSES DEFENSED, EIGHT FORCED FUMBLES, SEVEN FUMBLE RECOVERIES AND TWO INTERCEPTIONS IN HIS 14-YEAR CAREER\nHAS REGISTERED 16 MULTI-SACK GAMES IN HIS NFL REGULAR-SEASON CAREER, WHICH RANKS TIED FOR FIFTH IN FRANCHISE HISTORY\nTHE STEELERS ARE 14-0-1 WHEN HE HAS A MULTI-SACK GAME AND 12-0-1 WHEN HE HAS AT LEAST 2.0 SACKS\nHIS 133 TACKLES FOR LOSS ARE THE MOST BY AN ACTIVE NFL DEFENSIVE TACKLE\nHIS 718 TACKLES ARE MOST BY AN ACTIVE NFL DEFENSIVE TACKLE\nHIS 58 PASSES DEFENSED ARE THE MOST AMONG ACTIVE NFL DEFENSIVE TACKLES\nMADE NFL DEBUT IN WEEK 1 OF 2011 (AT BALTIMORE)\nMADE NFL STARTING DEBUT IN WEEK 3 OF 2013 (VS. CHICAGO)": []
    }
  },
  "15863": {
    "player_name": "Darius Slay",
    "player_url": "https://www.steelers.com/team/players-roster/darius-slay",
    "player_id": "15863",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 177 REGULAR-SEASON GAMES (167 STARTS) OVER HIS 12-YEAR NFL CAREER (DETROIT 2013-19; PHILDELPHIA 2020-24)\nHAS REGISTERED 614 TACKLES (512 SOLO), 161 PASSES DEFENSED, 28 INTERCEPTIONS, 16 TACKLES FOR LOSS, FIVE FUMBLE RECOVERIES, THREE INTERCEPTIONS RETURNED FOR TD, TWO FORCED FUMBLES, ONE QUARTERBACK HIT AND 1.0 SACK\nLED PHILADELPHIA NO. 1 PASS DEFENSE AND CONTRIBUTED TO THE EAGLES OWNING THE NFL'S NO. 1 TOTAL DEFENSE, EN ROUTE TO A SUPER BOWL LIX VICTORY\nLEADS ALL NFL PLAYERS WITH 161 PDS SINCE THE 2013 CAMPAIGN\nSIX-TIME PRO BOWL HONOREE (2018, 2019, 2020, 2022, 2023, 2024)\nNAMED FIRST-TEAM ALL-PRO BY THE ASSOCIATED PRESS IN 2017\nVOTED A TEAM CAPTAIN FOR THE FIRST TIME IN HIS CAREER IN 2022, WHEN HE HELPED THE EAGLES DEFENSE MAKE A SUPER BOWL LVII APPEARANCE\nLED THE NFL WITH A CAREER-HIGH EIGHT INTERCEPTIONS (TIED) AND 26 PASSES DEFENSED IN 2017\nMADE NFL DEBUT IN WEEK 1 OF 2013 (VS. MINNESOTA)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2013 (VS. MINNESOTA)": []
    }
  },
  "17372": {
    "player_name": "Chris Boswell",
    "player_url": "https://www.steelers.com/team/players-roster/chris-boswell",
    "player_id": "17372",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nEARNED PRO BOWL SELECTIONS IN 2017 AND 2024\nNAMED FIRST TEAM ALL-PRO BY ASSOCIATED PRESS, SPORTING NEWS, PRO FOOTBALL WRITERS, NFLPA AND PRO FOOTBALL FOCUS IN 2024\nHAS PLAYED IN 150 REGULAR-SEASON GAMES OVER HIS 10-YEAR NFL CAREER (ALL WITH THE STEELERS)\nONE OF THREE CURRENT STEELERS WHO HAVE PLAYED AT LEAST 120 REGULAR-SEASON GAMES FOR THE FRANCHISE (CAMERON HEYWARD 211; CHRIS BOSWELL 150; T.J. WATT 121)\nHAS MADE 272-OF-309 FIELD GOAL ATTEMPTS (88.0%), INCLUDING 123-OF-153 (80.4%) ON ATTEMPTS OF 40 YARDS OR LONGER SINCE JOINING THE STEELERS IN 2015\nTOTALED 1,127 CAREER POINTS ON 272 FIELD GOALS AND 311 EXTRA-POINTS MADE\nFOUR-TIME AFC SPECIAL TEAMS PLAYER OF THE MONTH (SEPTEMBER 2024; OCTOBER 2024; DECEMBER 2015; JANUARY 2015)\nFOUR-TIME AFC SPECIAL TEAMS PLAYER OF THE WEEK (WEEK 6, 2015; WEEK 13, 2017; WEEK 1, 2024; WEEK 11, 2024)\nMADE NFL DEBUT IN WEEK 5 OF 2015 (AT SAN DIEGO)": []
    }
  },
  "2575164": {
    "player_name": "Miles Killebrew",
    "player_url": "https://www.steelers.com/team/players-roster/miles-killebrew",
    "player_id": "2575164",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 146 GAMES (FIVE STARTS) OVER HIS NINE-YEAR NFL CAREER (DETROIT 2016-20; STEELERS 2021-24)\nTWO-TIME PRO BOWLER (2023, 2024)\n2023 ASSOCIATED PRESS FIRST TEAM ALL-PRO\n2023 PRO FOOTBALL WRITERS OF AMERICA (PFWA) ALL-NFL TEAM\nSTEELERS THREE-TIME SPECIAL TEAMS CAPTAIN (2022-24)\nHAS REGISTERED 75 TACKLES (60 SOLO), SIX PASSES DEFENSED, TWO INTERCEPTIONS, THREE TACKLES FOR LOSS, THREE QUARTERBACK HITS, ONE FORCED FUMBLE AND ONE INTERCEPTION RETURN FOR TD\nSINCE ENTERING THE NFL IN 2016, KILLEBREW HAS 86 TACKLES ON SPECIAL TEAMS, WHICH IS THE FIFTH-MOST IN THE LEAGUE IN THAT SPAN\nSINCE ENTERING THE NFL IN 2016, KILLEBREW HAS 67 SOLO TACKLES ON SPECIAL TEAMS, WHICH IS THE FOURTH-MOST IN THE LEAGUE IN THAT SPAN\nKILLEBREW HAS LOGGED 2,876 SNAPS ON SPECIAL TEAMS, WHICH IS THE MOST AMONG ALL PLAYERS SINCE HE ENTERED THE LEAGUE IN 2016 (THE SECOND-MOST IS 2024 TEAMMATE TYLER MATAKEVICH)\nHIS FOUR CAREER BLOCKED PUNTS ARE TIED FOR THE MOST BY ANY ACTIVE PLAYER IN THE LEAGUE\nHIGHEST DRAFT PICK IN SOUTHERN UTAH HISTORY\nMADE NFL DEBUT IN WEEK 1 OF 2016 (AT INDIANAPOLIS)\nMADE NFL STARTING DEBUT IN WEEK 3 OF 2017 (VS. ATLANTA)": []
    }
  },
  "2974348": {
    "player_name": "Dean Lowry",
    "player_url": "https://www.steelers.com/team/players-roster/dean-lowry",
    "player_id": "2974348",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 132 REGULAR-SEASON GAMES (85 STARTS) IN HIS NINE-YEAR NFL CAREER (GREEN BAY 2016-22; MINNESOTA 2023, PITTSBURGH 2024)\nHAS REGISTERED 271 TACKLES (144 SOLO), 33 QUARTERBACK HITS, 23 TACKLES FOR LOSS, 16.5 SACKS, 18 PASSES DEFENSED, ONE INTERCEPTION, ONE FORCED FUMBLE AND FIVE FUMBLE RECOVERIES\nMISSED ONLY THREE REGULAR-SEASON GAMES IN HIS FIRST SEVEN SEASONS IN THE NFL (GREEN BAY 2016-22)\nHIS 132 REGULAR-SEASON GAMES PLAYED ARE TIED FOR THE 13TH-MOST IN THE NFL AMONG DEFENSIVE LINEMEN SINCE 2016\nSET OR TIED CAREER HIGHS IN SACKS (FIVE), QB HITS (NINE) AND PASSES DEFENSED (FOUR) IN 2021\nHAS APPEARED IN EIGHT POSTSEASON CONTESTS WITH FIVE STARTS, RECORDING 18 TACKLES (SEVEN SOLO).\nMADE NFL DEBUT IN WEEK 1 OF 2016 (AT JACKSONVILLE)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2017 (VS. SEATTLE)": []
    }
  },
  "2978247": {
    "player_name": "Isaac Seumalo",
    "player_url": "https://www.steelers.com/team/players-roster/isaac-seumalo",
    "player_id": "2978247",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 111 GAMES (90 STARTS) IN HIS NINE-YEAR NFL CAREER WITH PHILADELPHIA (2016-22) AND PITTSBURGH (2023-24)\nHAS STARTED 70 GAMES AT LEFT GUARD, 19 GAMES AT RIGHT GUARD AND ONE AT RIGHT TACKLE\nWAS A MEMBER OF THE EAGLES' SUPER BOWL LII-WINNING TEAM IN 2017\nMADE NFL DEBUT IN WEEK 9 OF 2016 (AT NEW YORK GIANTS)\nMADE NFL STARTING DEBUT IN WEEK 12 OF 2016 (VS. GREEN BAY)": []
    }
  },
  "2978278": {
    "player_name": "Andrus Peat",
    "player_url": "https://www.steelers.com/team/players-roster/andrus-peat",
    "player_id": "2978278",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 111 REGULAR-SEASON GAMES (102 STARTS) IN HIS 10-YEAR NFL CAREER WITH NEW ORLEANS (2015-23) AND LAS VEGAS (2024)\nTHREE-TIME PRO BOWL SELECTION (2018, 2019, 2020)\nMADE NFL DEBUT IN WEEK 1 OF 2015 (AT ARIZONA)\nMADE NFL STARTING DEBUT IN WEEK 2 OF 2015 (VS. TAMPA BAY)": []
    }
  },
  "2978524": {
    "player_name": "Christian Kuntz",
    "player_url": "https://www.steelers.com/team/players-roster/christian-kuntz",
    "player_id": "2978524",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 68 REGULAR-SEASON GAMES IN HIS FOUR-YEAR NFL CAREER (PITTSBURGH 2021-24)\nMADE HIS NFL DEBUT IN WEEK 1 OF 2021 (AT BUFFALO)": []
    }
  },
  "3042749": {
    "player_name": "Logan Woodside",
    "player_url": "https://www.steelers.com/team/players-roster/logan-woodside",
    "player_id": "3042749",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 13 CAREER REGULAR-SEASON GAMES (NO STARTS) IN FOUR-YEAR CAREER FOR CINCINNATI (2018, 2024), TENNESSEE (2020-21) AND ATLANTA (2022-23)\nHAS COMPLETED FOUR OF SEVEN PASSES FOR 34 YARDS AND AN INTERCEPTION, WHILE RUSHING FOR 18 YARDS ON 10 ATTEMPTS\nPLAYED FOR SAN ANTONIO COMMANDERS OF ALLIANCE OF AMERICAN FOOTBALL IN 2019, AND IN SEVEN GAMES WENT 112-FOR-192 FOR 1,353 YARDS AND SEVEN TDS WITH SEVEN INTERCEPTIONS\nMADE NFL DEBUT IN WEEK 10 OF 2020 (VS. INDIANAPOLIS)": []
    }
  },
  "3045282": {
    "player_name": "T.J. Watt",
    "player_url": "https://www.steelers.com/team/players-roster/t-j-watt",
    "player_id": "3045282",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                AWARDS\n\n              \n              \n                \n2021 ASSOCIATED PRESS DEFENSIVE PLAYER OF THE YEAR\n2021 PFWA DEFENSIVE PLAYER OF THE YEAR\n2021 SPORTING NEWS DEFENSIVE PLAYER OF THE YEAR\nSEVEN-TIME PRO BOWLER (2018, 2019, 2020, 2021, 2022, 2023, 2024)\nEIGHT-TIME AFC DEFENSIVE PLAYER OF THE WEEK (WEEKS 1 AND 5 OF 2018; WEEK 2 OF 2020; WEEKS 6, 13 AND 17 OF 2021; WEEK 18 OF 2023; WEEK 8 OF 2024)\nSIX-TIME NFL TOP 100 (2019, 93; 2020, 25; 2021, 9; 2022, 6; 2023, 27; 2024, 8)\nFIVE-TIME PRO FOOTBALL WRITERS OF AMERICA (PFWA) FIRST TEAM ALL-NFL (2019, 2020, 2021, 2023, 2024)\nFIVE-TIME PITTSBURGH STEELERS MVP (2019, 2020, 2021, 2023, 2024)\nFIVE-TIME SPORTING NEWS FIRST TEAM ALL-PRO (2019, 2020, 2021, 2023, 2024)\nFOUR-TIME ASSOCIATED PRESS FIRST TEAM ALL-PRO (2019, 2020, 2021, 2023)\nHIS FOUR AP FIRST TEAM ALL-PRO SELECTIONS IS TIED FOR THE FIFTH-MOST AMONG ACTIVE NFL PLAYERS\nFOUR-TIME STEELERS TEAM CAPTAIN (2020, 2022, 2023, 2024)\nFOUR-TIME AFC DEFENSIVE PLAYER OF THE MONTH (NOVEMBER 2019; SEPTEMBER 2020; NOVEMBER 2020; SEPTEMBER 2023)\nTHREE-TIME THE COMMITTEE OF 101 AFC DEFENSIVE PLAYER OF THE YEAR (2020, 2021, 2023)\nTHREE-TIME DEACON JONES AWARD WINNER (2020, 2021, 2023)\nTHREE-TIME PRO FOOTBALL FOCUS FIRST TEAM ALL-PRO (2019, 2020, 2024)\nTWO-TIME ASSOCIATED PRESS SECOND TEAM ALL-PRO (2020, 2024)\nTWO-TIME ASSOCIATED PRESS DEFENSIVE PLAYER OF THE YEAR RUNNER-UP (2020, 2023)\n2017 NFL ALL-ROOKIE TEAM": []
    }
  },
  "3045373": {
    "player_name": "Jalen Ramsey",
    "player_url": "https://www.steelers.com/team/players-roster/jalen-ramsey",
    "player_id": "3045373",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nSEVEN-TIME PRO BOWLER (2017, 2018, 2019, 2020, 2021, 2022, 2023)\nTHREE-TIME ASSOCIATED PRESS FIRST TEAM ALL-PRO (2017, 2020, 2021)\nTHREE-TIME PFW/PFWA ALL-NFL TEAM (2017, 2020, 2021)\nTHREE-TIME TEAM CAPTAIN (2021, 2022, 2024)\n2016 PFW/PFWA ALL-ROOKIE TEAM\nHAS PLAYED IN 135 GAMES (134 STARTS) OVER HIS NINE-YEAR NFL CAREER (JAGUARS 2016-19; RAMS 2019-22; DOLPHINS 2023-24)\nHAS REGISTERED 534 TACKLES (432 SOLO), 108 PASSES DEFENSED, 24 INTERCEPTIONS, 27 TACKLES FOR LOSS, TWO FUMBLE RECOVERIES, SEVEN FORCED FUMBLES, ONE INTERCEPTION RETURN FOR TD, NINE QUARTERBACK HITS AND 3.0 SACKS\nHAS STARTED 10 POSTSEASON GAMES – SIX WITH THE L.A. RAMS, THREE WITH JACKSONVILLE AND ONE WITH MIAMI\nWON SUPER BOWL LVI WITH THE L.A. RAMS\nHIS 108 PASSES DEFENSED RANK THIRD AMONG ACTIVE PLAYES SINCE ENTERING THE LEAGUE IN 2016\nHIS 24 INTERCEPTIONS RANK FOURTH AMONG ACTIVE PLAYES SINCE ENTERING THE LEAGUE IN 2016\nHIS 14 PASSES DEFENSED LED ALL NFL ROOKIES IN 2016\nHAS REGISTERED 26 TOTAL TAKEAWAYS (24 INTERCEPTIONS AND TWO FUMBLE RECOVERIES), WHICH IS THE SIXTH-MOST IN THE NFL AMONG ACTIVE PLAYERS SINCE THE START OF THE 2016 SEASON\nHAS REGISTERED AT LEAST TWO PASSES DEFENSED IN A GAME 25 TIMES IN HIS CAREER\nHAS REGISTERED AT LEAST TWO INTERCEPTIONS IN A GAME THREE TIMES IN HIS CAREER\nMADE NFL DEBUT IN WEEK 1 OF 2016 (VS. GREEN BAY)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2016 (VS. GREEN BAY)": []
    }
  },
  "3045463": {
    "player_name": "Chuck Clark",
    "player_url": "https://www.steelers.com/team/players-roster/chuck-clark",
    "player_id": "3045463",
    "trivia": {}
  },
  "3052059": {
    "player_name": "Daniel Ekuale",
    "player_url": "https://www.steelers.com/team/players-roster/daniel-ekuale",
    "player_id": "3052059",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 57 REGULAR-SEASON GAMES (21 STARTS) OVER HIS SIX-YEAR NFL CAREER (CLEVELAND 2019; JACKSONVILLE 2020; NEW ENGLAND 2021-24)\nHAS REGISTERED 91 TACKLES (49 SOLO), 6.0 SACKS, ONE PASS DEFENSED, NINE QUARTERBACK HITS, EIGHT TACKLES FOR LOSS AND ONE FORCED FUMBLE\nMADE NFL DEBUT IN WEEK 1 OF 2019 (VS. TENNESSEE)\nMADE NFL STARTING DEBUT IN WEEK 13 OF 2020 (AT MINNESOTA)": []
    }
  },
  "3054212": {
    "player_name": "Jonnu Smith",
    "player_url": "https://www.steelers.com/team/players-roster/jonnu-smith",
    "player_id": "3054212",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 124 CAREER REGULAR-SEASON GAMES (84 STARTS) IN NINE-YEAR NFL CAREER (TENNESSEE 2017-20; NEW ENGLAND 2021-22; ATLANTA 2023; MIAMI 2024)\nPRO BOWL SELECTION IN 2024\nHAS CAUGHT 307 PASSES FOR 3,307 YARDS AND 28 TDS\nRUSHED FOR 126 YARDS ON 19 CARRIES (6.6 AVG.) AND ONE TD\nRETURNED THREE KICKOFFS FOR 47 YARDS (15.7 AVG.)\nHAS PLAYED IN SEVEN POSTSEASON GAMES (SIX STARTS), INCLUDING FIVE WITH TENNESSEE AND ONE WITH NEW ENGLAND\nHIS 88 RECEPTIONS, 884 RECEIVING YARDS AND EIGHT RECEIVING TDS IN 2024 WERE THE MOST BY A DOLPHINS TIGHT END IN A SINGLE SEASON\nHIS 884 RECEIVING YARDS IN 2024 WERE THE FOURTH-MOST IN THE LEAGUE BY A TIGHT END\nMADE NFL DEBUT IN WEEK 1 OF 2017 (VS. OAKLAND)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2017 (VS. OAKLAND)": []
    }
  },
  "3115962": {
    "player_name": "Jabrill Peppers",
    "player_url": "https://www.steelers.com/team/players-roster/jabrill-peppers",
    "player_id": "3115962",
    "trivia": {}
  },
  "3116407": {
    "player_name": "Mason Rudolph",
    "player_url": "https://www.steelers.com/team/players-roster/mason-rudolph",
    "player_id": "3116407",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nCAREER REGULAR-SEASON RECORD AS A STARTER: 9-8-1 (.528): 5-3 (.625) IN '19, 0-1 (.000) IN '20, 0-0-1 (.500) IN '21, 3-0 (1.000) IN '23 AND 1-4 (.200) IN '24\nHAS PLAYED IN 29 REGULAR-SEASON GAMES (18 STARTS) OVER HIS SIX-YEAR NFL CAREER (PITTSBURGH 2018-23, TENNESSEE 2024)\nHAS COMPLETED 437-OF-686 PASSES (63.7 PERCENT) FOR 4,615 YARDS AND 28 TDS IN HIS CAREER\nSET FRANCHISE RECORDS FOR A QB IN FIRST CAREER HOME START (9/30/19 VS CINCINNATI) IN COMPLETIONS (24), COMPLETION PERCENTAGE (85.7), AND QB RATING (124.6)\nSET SINGLE-GAME CAREER HIGH IN PASSING YARDS (315) AT CLEVELAND IN WEEK 17 OF 2020 (1/3/21)\nSET SINGLE-GAME CAREER HIGH IN PASS ATTEMPTS (50) VS. DETROIT IN WEEK 10 OF 2021 (11/14/21)\nSET SINGLE-GAME CAREER HIGH IN COMPLETIONS (30) VS. DETROIT IN WEEK 10 OF 2021 (11/14/21)\nHAS REGISTERED NINE MULTI-TD PASSING GAMES\nLED THE STEELERS TO THREE CONSECUTIVE WINS TO CLOSE THE 2023 REGULAR SEASON, INCLUDING A PAIR OF ROAD WINS AT SEATTLE AND BALTIMORE\nCOMPLETED 18-OF-20 PASSES (90 PERCENT) FOR 152 YARDS, ONE TD AND A 115.0 RATING AT BALTIMORE IN WEEK 18 OF 2023\nHIS 90.0 COMPLETION PERCENTAGE IS THE BEST IN SINGLE-GAME FRANCHISE HISTORY (MIN. 20 PASS ATTEMPTS)\nHAS TWO OF THE TOP FOUR BEST COMPLETION PERCENTAGE GAMES IN FRANCHISE HISTORY (24-28, 85.7, 09/30/2019 VS. CINCINNATI)\nFIRST QUARTERBACK IN NFL HISTORY TO REGISTER HIS FIRST TWO CAREER WINS ON MONDAY NIGHT FOOTBALL\nTHIRD QUARTERBACK SINCE THE 1970 NFL-AFL MERGER TO RECORD A PASSER RATING OF AT LEAST 81.4 AND THROW A TD IN EACH OF HIS FIRST SEVEN CAREER STARTS\nFIFTH QUARTERBACK SINCE THE 1970 NFL-AFL MERGER TO THROW A TD IN EACH OF HIS FIRST EIGHT CAREER GAMES (JAY CUTLER, MIKE GLENNON, OLIVER LUCK AND MARK RYPIEN)\nMADE NFL DEBUT IN WEEK 2 OF 2019 (VS. SEATTLE)\nMADE NFL STARTING DEBUT IN WEEK 3 OF 2019 (AT SAN FRANCISCO)": []
    }
  },
  "3116689": {
    "player_name": "Cole Holcomb",
    "player_url": "https://www.steelers.com/team/players-roster/cole-holcomb",
    "player_id": "3116689",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 58 CAREER REGULAR-SEASON GAMES (56 STARTS) OVER HIS FIVE-YEAR NFL CAREER (WASHINGTON, 2019-22; PITTSBURGH 2023)\nHAS REGISTERED 436 TACKLES (264 SOLO), 19 TACKLES FOR LOSS, 12 PASSES DEFENSED, 4.5 SACKS, SEVEN FORCED FUMBLES, 11 QUARTERBACK HITS, THREE INTERCEPTIONS AND ONE INTERCEPTION RETURNED FOR A TOUCHDOWN\nHAS RECORDED DOUBLE-DIGIT TACKLES IN 16 GAMES\nMADE NFL DEBUT IN WEEK 1 OF 2019 (AT PHILADELPHIA)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2019 (AT PHILADELPHIA)": []
    }
  },
  "3123867": {
    "player_name": "Calvin Anderson",
    "player_url": "https://www.steelers.com/team/players-roster/calvin-anderson",
    "player_id": "3123867",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 50 REGULAR-SEASON GAMES (14 STARTS) IN FIVE-YEAR NFL CAREER (DENVER 2020-22, NEW ENGLAND 2023, PITTSBURGH 2022-24)": []
    }
  },
  "3125280": {
    "player_name": "Corliss Waitman",
    "player_url": "https://www.steelers.com/team/players-roster/corliss-waitman",
    "player_id": "3125280",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 35 REGULAR-SEASON GAMES OVER HIS THREE-YEAR NFL CAREER (PITTSBURGH 2021; DENVER 2022; PITTSURGH 2024)\nHAS PUNTED 168 TIMES FOR 7,850 YARDS (46.7 AVG. / 41.7 NET) WITH 12 TOUCHBACKS AND 58 PUNTS INSIDE OF THE 20-YARD LINE\nMADE NFL DEBUT WITH PITTSBURGH IN WEEK 16 OF 2021 (AT KANSAS CITY)": []
    }
  },
  "3126035": {
    "player_name": "Max Scharping",
    "player_url": "https://www.steelers.com/team/players-roster/max-scharping",
    "player_id": "3126035",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 67 GAMES (33 STARTS) IN HIS FIVE-YEAR NFL CAREER WITH THE TEXANS (2019-2021), BENGALS (2023), COMMANDERS (2024), AND THE STEELERS (2024)": []
    }
  },
  "3912092": {
    "player_name": "Donald Parham Jr.",
    "player_url": "https://www.steelers.com/team/players-roster/donald-parham-jr",
    "player_id": "3912092",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 47 CAREER REGULAR-SEASON GAMES (21 STARTS) IN FOUR-YEAR NFL CAREER (L.A. CHARGERS 2020-23; DENVER 2024)\nHAS CAUGHT 67 PASSES FOR 764 YARDS YARDS AND 11 TDS\nWITH EACH OF HIS FIRST TWO CAREER RECEPTIONS GOING FOR TDS, BECAME THE FIRST CHARGERS PLAYER SINCE 1978 TO REGISTER SCORES ON EACH OF HIS FIRST TWO CAREER CATCHES\nTIED FOR THE SECOND-MOST TD RECEPTIONS (11) BY PLAYERS WITH 70 OR FEWER CAREER CATCHES SINCE THE 1970 AFL-NFL MERGER (ONLY KELLEN DAVIS REGISTERED MORE TD RECEPTIONS, 13, WITH 70 OR FEWER CAREER CATCHES)\nHAS REGISTERED A FIRST DOWN OR TD ON 71.6% OF HIS CAREER CATCHES\nMADE NFL DEBUT IN WEEK 4 OF 2020 FOR L.A. CHARGERS (AT BUFFALO)\nMADE NFL STARTING DEBUT IN WEEK 8 OF 2020 FOR L.A. CHARGERS (AT DENVER)": []
    }
  },
  "3914397": {
    "player_name": "Scotty Miller",
    "player_url": "https://www.steelers.com/team/players-roster/scotty-miller",
    "player_id": "3914397",
    "trivia": {}
  },
  "3917909": {
    "player_name": "Juan Thornhill",
    "player_url": "https://www.steelers.com/team/players-roster/juan-thornhill",
    "player_id": "3917909",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 87 REGULAR-SEASON GAMES (74 STARTS) OVER HIS SIX-YEAR NFL CAREER (KANSAS CITY 2019-22; CLEVELAND 2023-24)\nHAS REGISTERED 335 TACKLES (232 SOLO), 24 PASSES DEFENSED, EIGHT INTERCEPTIONS, SIX TACKLES FOR LOSS, ONE FUMBLE RECOVERY, ONE FORCED FUMBLE, SEVEN QUARTERBACK HITS, ONE INTERCEPTION RETURN FOR TD AND 1.0 SACK\nHELPED BROWNS DEFENSE LEAD THE NFL IN TOTAL YARDS ALLOWED AND PASSING YARDS ALLOWED IN 2023\nHAS PLAYED IN 10 POSTSEASON CONTESTS (SEVEN STARTS), INCLUDING TWO SUPER BOWLS, AND NOTCHED 32 TACKLES AND 10 PASS BREAKUPS\nRECORDED FIVE TACKLES, INCLUDING ONE FOR A LOSS, AND A PASS DEFENSED IN KANSAS CITY'S SUPER BOWL LVII WIN OVER PHILADELPHIA\nTWO-TIME SUPER BOWL CHAMPION (SUPER BOWL LIV AND SUPER BOWL LVII)\n2019 PFW/PFWA ALL-ROOKIE TEAM\nMADE NFL DEBUT IN WEEK 1 OF 2019 (AT JACKSONVILLE)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2019 (AT JACKSONVILLE)": []
    }
  },
  "3929846": {
    "player_name": "DeShon Elliott",
    "player_url": "https://www.steelers.com/team/players-roster/deshon-elliott",
    "player_id": "3929846",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 72 GAMES (64 STARTS) OVER HIS SEVEN-YEAR NFL CAREER (BALTIMORE 2019-21; DETROIT 2022; MIAMI 2023; PITTSBURGH 2024-25)\nHAS REGISTERED 391 TACKLES (271 SOLO), 23 PASSES DEFENSED, FOUR INTERCEPTIONS, 17 TACKLES FOR LOSS, FIVE FUMBLE RECOVERIES, FIVE FORCED FUMBLES, 13 QUARTERBACK HITS AND 3.5 SACKS\nMADE NFL DEBUT IN WEEK 1 OF 2019 (AT MIAMI)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2020 (VS. CLEVELAND)": []
    }
  },
  "4035253": {
    "player_name": "Ryan McCollum",
    "player_url": "https://www.steelers.com/team/players-roster/ryan-mccollum",
    "player_id": "4035253",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 30 GAMES (THREE START) OVER HIS FOUR-YEAR NFL CAREER (DETROIT 2021; PITTSBURGH 2022-24)\nMADE NFL DEBUT IN WEEK 5 OF 2021 (AT MINNESOTA)\nMADE NFL STARTING DEBUT IN WEEK 6 OF 2021 (VS. CINCINNATI)": []
    }
  },
  "4035656": {
    "player_name": "Ben Skowronek",
    "player_url": "https://www.steelers.com/team/players-roster/ben-skowronek",
    "player_id": "4035656",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 55 REGULAR-SEASON GAMES (13 STARTS) OVER FOUR-YEAR NFL CAREER (L.A. RAMS 2021-23; PITTSBURGH 2024)\nHAS REGISTERED 63 RECEPTIONS FOR 644 YARDS (10.2 AVG.) AND ONE TD\nHAS RECORDED THREE RUSHES FOR 26 YARDS (8.7 AVG.) AND ONE TD\nHAS RETURNED FOUR CAREER KICKOFFS FOR 70 YARDS (17.5 AVG.)\nHAS REGISTERED 26 TACKLES (19 SOLO) AND TWO FUMBLE RECOVERIES ON SPECIAL TEAMS\nHAS PLAYED IN SIX POSTSEASON GAMES (NO STARTS)\nHAS CAUGHT THREE PASSES FOR 17 YARDS (5.7 AVG.) IN PLAYOFF GAMES\nHAS RETURNED FOUR KICKOFFS IN HIS CAREER FOR 70 YARDS (17.5 AVG.)": []
    }
  },
  "4035798": {
    "player_name": "Isaiahh Loudermilk",
    "player_url": "https://www.steelers.com/team/players-roster/isaiahh-loudermilk",
    "player_id": "4035798",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 58 REGULAR-SEASON GAMES (FIVE STARTS) IN FOUR-YEAR NFL CAREER (PITTSBURGH 2021-24)\nHAS REGISTERED 63 TACKLES (38 SOLO), 1.0 SACK, SIX PASSES DEFENSED, ONE QUARTERBACK HIT, ONE TACKLE FOR LOSS\nMADE NFL DEBUT IN WEEK 2 OF 2021 (VS. LAS VEGAS)\nMADE NFL STARTING DEBUT IN WEEK 16 OF 2021 (AT KANSAS CITY)": []
    }
  },
  "4036419": {
    "player_name": "Skylar Thompson",
    "player_url": "https://www.steelers.com/team/players-roster/skylar-thompson",
    "player_id": "4036419",
    "trivia": {}
  },
  "4037333": {
    "player_name": "Alex Highsmith",
    "player_url": "https://www.steelers.com/team/players-roster/alex-highsmith",
    "player_id": "4037333",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 77 GAMES (66 STARTS) IN HIS FIVE-YEAR NFL CAREER (PITTSBURGH 2020-24)\nHAS REGISTERED 281 TACKLES (172 SOLO), 49 TACKLES FOR LOSS, 35.5 SACKS, 72 QUARTERBACK HITS, THREE INTERCEPTIONS, SEVEN PASSES DEFENSED, NINE FORCED FUMBLES AND ONE INTERCEPTION RETURN FOR TD\nHAS RECORDED SIX TACKLES (FOUR SOLO) ON SPECIAL TEAMS\nHIS INTERCEPTION RETURN FOR TD IN WEEK 2 OF 2023 VS. CLEVELAND CAME NINE SECONDS INTO THE GAME, WHICH WAS THE FASTEST TD TO OPEN A GAME FOR THE STEELERS SINCE THE 1970 AFL-NFL MERGER\nFIRST STEELERS PLAYER TO RECORD AN INTERCEPTION ON THE FIRST PLAY FROM SCRIMMAGE IN A GAME SINCE WILLIAM GAY IN 2014\nIN PITTSBURGH'S VICTORY OVER CLEVELAND IN WEEK 2 OF 2023, HIGHSMITH AND T.J. WATT BOTH RECORDED A SACK AND DEFENSIVE TD -- BECOMING THE FIRST PAIR OF TEAMMATES TO EACH POST A SACK AND TD IN THE SAME GAME SINCE 1982, WHEN THE SACK BECAME AN OFFICIAL STATISTIC\nSINCE 2020, ONLY ONE TEAM HAS HAD THREE PLAYERS WITH AT LEAST 26.5 SACKS, 59 QUARTERBACK HITS AND 40 TACKLES FOR LOSS (PITTSBURGH'S T.J. WATT, CAMERON HEYWARD AND ALEX HIGHSMITH)\nONLY PLAYER IN THE NFL IN 2023 WITH AT LEAST 7.0 SACKS AND TWO INTERCEPTIONS\nONE OF JUST THREE PLAYERS IN THE LEAGUE WITH AT LEAST 7.0 SACKS AND TWO INTERCEPTIONS IN A SEASON SINCE ENTERING THE NFL IN 2020\nHIS 21.5 SACKS ARE THE 12TH-MOST IN THE NFL SINCE THE START OF THE 2022 SEASON\nHIS SEVEN FORCED FUMBLES ARE TIED FOR THE SECOND-MOST IN THE NFL SINCE THE START OF THE 2022 SEASON\nHIS SIX STRIP SACKS ARE TIED FOR THE SECOND-MOST IN THE NFL SINCE THE START OF THE 2022 SEASON\nHAS RECORDED 24.5 SACKS IN HIS LAST 37 GAMES, DATING BACK TO WEEK 16 OF THE 2021 SEASON, WHICH IS THE 12TH-MOST IN THE NFL OVER THE SPAN\nHAS RECORDED SEVEN STRIP SACKS IN HIS LAST 37 GAMES, DATING BACK TO WEEK 16 OF THE 2021 SEASON, WHICH IS THE SECOND-MOST IN THE NFL OVER THE SPAN\nHAS REGISTERED EIGHT FORCED FUMBLES IN HIS LAST 37 GAMES, DATING BACK TO WEEK 16 OF THE 2021 SEASON, WHICH IS THE SECOND-MOST IN THE NFL OVER THE SPAN\nHAS RECORDED SEVEN MULTI-SACK GAMES IN HIS CAREER\nMADE NFL DEBUT IN WEEK 1 OF 2020 (AT N.Y. GIANTS)\nMADE NFL STARTING DEBUT IN WEEK 13 OF 2020 (VS. WASHINGTON)": []
    }
  },
  "4040615": {
    "player_name": "Malik Harrison",
    "player_url": "https://www.steelers.com/team/players-roster/malik-harrison",
    "player_id": "4040615",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 76 REGULAR-SEASON GAMES (34 STARTS) IN HIS FIVE-YEAR NFL CAREER (BALTIMORE 2020-24)\nHAS REGISTERED 44 TACKLES (28 SOLO), 10 TACKLES FOR LOSS, 8.5 SACKS, 14 QUARTERBACK HITS, SIX FORCED FUMBLES AND TWO FUMBLE RECOVERIES\nHAS RECORDED FIVE TACKLES (FOUR SOLO) ON SPECIAL TEAMS\nHAS PLAYED IN SEVEN CAREER POSTSEASON GAMES (FOUR STARTS)\nHAS REGISTERED 20 TACKLES (EIGHT SOLO), ONE TACKLES FOR LOSS AND ONE FORCED FUMBLE\nMADE NFL DEBUT IN WEEK 1 OF 2020 (VS. CLEVELAND)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2020 (VS. CLEVELAND)\nAPPEARED IN 15 REGULAR-SEASON GAMES (SEVEN STARTS) FOR BALTIMORE IN 2024, SETTING CAREER HIGHS IN TACKLES (46), SOLO TACKLES (30), SACKS (2.0) AND TACKLES FOR LOSS (THREE)\nADDED A CAREER-BEST EIGHT TACKLES ON SPECIAL TEAMS\nHELPED BALTIMORE'S DEFENSE RANK NO. 1 AGAINST THE RUN (80.1 YARDS/GAME) AND NO. 2 IN BOTH SACKS (54.0) AND FOURTH-DOWN EFFICIENCY (42.9%)": []
    }
  },
  "4047650": {
    "player_name": "DK Metcalf",
    "player_url": "https://www.steelers.com/team/players-roster/dk-metcalf",
    "player_id": "4047650",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 97 REGULAR-SEASON GAMES (93 STARTS) OVER SIX-YEAR NFL CAREER (SEATTLE 2019-24)\nHAS REGISTERED 438 RECEPTIONS FOR 6,324 YARDS (14.4 AVG.) AND 48 TDS\nHAS RUSHED THREE TIMES FOR 17 YARDS (5.7 AVG.)\nHIS 48 RECEIVING TDS ARE THE EIGHTH-MOST AMONG ACTIVE PLAYERS IN THE LEAGUE\nHAS RECORDED THREE 1,000-YARD RECEIVING SEASONS (2020, 2022 AND 2023), REGISTERED 15 100-YARD RECEIVING GAMES AND POSTED 13 CATCHES OF 50 YARDS OR MORE IN HIS CAREER\nHIS 13 CATCHES OF 50 YARDS OR MORE RANK SEVENTH AMONG ACTIVE WIDEOUTS\nJOINED RANDY MOSS AS THE ONLY PLAYERS IN NFL HISTORY WITH 50 RECEPTIONS, 900 YARDS AND FIVE TDS IN EACH OF THEIR FIRST SIX SEASONS\nFIRST PLAYER IN SEATTLE HISTORY WITH THREE CONSECUTIVE 100-YARD RECEIVING GAMES (WEEKS 2-4 OF 2024)\nRANKED FIRST IN SEAHAWKS' HISTORY IN A PLAYER'S FIRST SIX SEASONS IN RECEPTIONS (438), RECEIVING YARDS (6,324) AND RECEIVING TDS (48)\nFINISHED HIS SEATTLE CAREER FOURTH ALL-TIME IN RECEIVING TDS (48)\n2022, 2023 PRO BOWL\n2020 ASSOCIATED PRESS SECOND-TEAM ALL-PRO\nHIS 1,114 YARDS IN 2023, MADE HIM THE SEVENTH PLAYER IN FRANCHISE HISTORY WITH BACK-TO-BACK 1,000 RECEIVING YARDS SEASONS\nIN 2022, SET A SINGLE-SEASON CAREER-HIGH WITH 90 RECEPTIONS (FOURTH-MOST IN FRANCHISE HISTORY) AND POSTED HIS SECOND-CAREER 1,000-YARD SEASON\nIN THE WILD CARD GAME AT SAN FRANCISCO IN 2023, LED TEAM WITH 10 RECEPTIONS FOR 136 YARDS AND TWO TDS; TIED RANDY MOSS FOR SECOND-MOST ALL-TIME WITH HIS THIRD-CAREER RECEIVING TD IN THE POSTSEASON OF AT LEAST 50 YARDS\nLED THE SEAHAWKS WITH 75 CATCHES AND 12 TDS (4TH NFL) IN 2021\nHIS 12 TD RECEPTIONS IN 2021 ARE TIED FOR THIRD-MOST IN A SINGLE SEASON IN SEATTLE HISTORY\nFIFTH PLAYER SINCE 1990 WITH AT LEAST 900 RECEIVING YARDS AND SEVEN TD RECEPTIONS IN EACH OF HIS FIRST THREE SEASONS, JOINING ODELL BECKHAM JR., JOEY GALLOWAY, A.J. GREEN AND RANDY MOSS\nJOINED RANDY MOSS (36) AND ODELL BECKHAM JR. (34) AS THE ONLY WIDE RECEIVERS SINCE 1990 WITH AT LEAST 25 TD RECEPTIONS IN THEIR FIRST 40 CAREER GAMES\nSTARTED ALL 16 GAMES PLAYED IN 2020 AND WAS NAMED SECOND-TEAM AP ALL-PRO AND NAMED TO THE PRO BOWL\nLED TEAM WHILE SETTING A FRANCHISE RECORD WITH 1,303 RECEIVING YARDS (STEVE LARGENT, 1,287 IN 1985)\nRECORDED 10 RECEPTIONS FOR A CAREER-HIGH 177 YARDS IN WEEK 12 OF 2020 AT PHILADELPHIA\nRANKED SECOND AMONG ALL NFL ROOKIE RECEIVERS IN 2019 WITH 58 RECEPTIONS AND THIRD WITH 900 RECEIVING YARDS -- BOTH SECOND ALL-TIME IN SEAHAWKS SINGLE-SEASON HISTORY\nIN THE WILD CARD AT PHILADELPHIA IN 2020, LED TEAM WITH SEVEN RECEPTIONS FOR 160 YARDS AND A 53-YARD TD\nHIS 160 YARDS RECEIVING ARE THE MOST-EVER BY A ROOKIE IN AN NFL PLAYOFF GAME AND MOST IN SEATTLE PLAYOFF HISTORY": []
    }
  },
  "4240759": {
    "player_name": "Esezi Otomewo",
    "player_url": "https://www.steelers.com/team/players-roster/esezi-otomewo",
    "player_id": "4240759",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN NINE REGULAR-SEASON GAMES (TWO STARTS) IN TWO SEASONS WITH THE VIKINGS (2022) AND JAGUARS (2024).\nHAS RECORDED NINE TACKLES (THREE SOLO), 0.5 SACKS, TWO QUARTERBACK HITS, ONE TACKLE FOR LOSS AND ONE FUMBLE RECOVERY.": []
    }
  },
  "4241401": {
    "player_name": "Trey Sermon",
    "player_url": "https://www.steelers.com/team/players-roster/trey-sermon",
    "player_id": "4241401",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 42 REGULAR-SEASON GAMES (FIVE STARTS) IN HIS FOUR-YEAR NFL CAREER (SAN FRANCISCO 2021; PHILADELPHIA 2022; INDIANAPOLIS 2023-24)\nHAS RECORDED 505 RUSHING YARDS AND THREE RUSHING TDS ON 134 ATTEMPTS (3.8 AVG.) AND ADDED 22 CATCHES FOR 138 YARDS (6.3 AVG.)\nHAS APPEARED IN ONE POSTSEASON GAME AND TALLIED ONE TACKLE ON SPECIAL TEAMS\nMADE NFL DEBUT IN WEEK 2 OF 2021 (AT PHILADELPHIA)\nMADE NFL STARTING DEBUT IN WEEK 3 OF 2021 (VS. GREEN BAY)": []
    }
  },
  "4241961": {
    "player_name": "Connor Heyward",
    "player_url": "https://www.steelers.com/team/players-roster/connor-heyward",
    "player_id": "4241961",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 51 REGULAR-SEASON GAMES (12 STARTS) IN HIS THREE-YEAR CAREER (PITTSBURGH 2022-24)\nHAS RECORDED 41 CATCHES FOR 358 YARDS (8.7 AVG.) AND TWO TDS\nHAS RUSHED FOR 27 YARDS ON THREE CARRIES (9.0 AVG.)\nMADE NFL DEBUT IN WEEK 1 OF 2022 (AT CINCINNATI)\nMADE NFL STARTING DEBUT IN WEEK 7 OF 2023 (AT L.A. RAMS)": []
    }
  },
  "4242207": {
    "player_name": "Patrick Queen",
    "player_url": "https://www.steelers.com/team/players-roster/patrick-queen",
    "player_id": "4242207",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 84 GAMES (84 STARTS) IN HIS FIVE-YEAR CAREER WITH BALTIMORE (2020-23) AND PITTSBURGH (2024)\nHAS REGISTERED 582 TACKLES (361 SOLO), 43 TACKLES FOR LOSS, 38 QUARTERBACK HITS, 14.5 SACKS, 22 PASSES DEFENSED, SEVEN FORCED FUMBLES, SEVEN FUMBLE RECOVERIES AND FOUR INTERCEPTIONS\nHAS PLAYED IN SIX POSTSEASON GAMES (FIVE STARTS) AND REGISTERED 33 TACKLES (23 SOLO), TWO QUARTERBACK HITS AND TWO TACKLES FOR LOSS\nTWO-TIME PRO-BOWL SELECTION (2024, 2023)\nEARNED ALL-PRO SECOND TEAM HONORS IN 2023\nONLY PLAYER IN THE NFL WITH AT LEAST 550 TACKLES, 40 TACKLES FOR LOSS, 20 PASSES DEFENSED, 10.0 SACKS, SEVEN FUMBLE RECOVERIES, SEVEN FORCED FUMBLES AND FOUR INTERCEPTIONS SINCE ENTERING THE LEAGUE IN 2020\nONE OF FIVE ACTIVE PLAYERS IN THE NFL WITH AT LEAST 550 TACKLES, 40 TACKLES FOR LOSS, 20 PASSES DEFENSED, 14.0 SACKS, SEVEN FUMBLE RECOVERIES, SEVEN FORCED FUMBLES AND FOUR INTERCEPTIONS (HARRISON SMITH, LAVONTE DAVID, BOBBY WAGNER AND ERIC KENDRICKS)\nONE OF JUST THREE NFL DEFENDERS TO POST AT LEAST FOUR INTERCEPTIONS, SEVEN FORCED FUMBLES AND SEVEN FUMBLE RECOVERIES SINCE 2020 WHEN HE ENTERED THE LEAGUE\nRANKS 12TH IN TACKLES, 18TH IN TACKLES FOR LOSS AND T-17THIN INTERCEPTIONS AMONG LINEBACKERS SINCE ENTERING THE LEAGUE IN 2020\nHAS ECLIPSED 100+ TACKLES AND NINE TACKLES FOR LOSS THREE DIFFERENT TIMES (2023, 2022, 2020)\nHAS ECLIPSED 100+ TACKLES FOUR DIFFERENT TIMES (2024, 2023, 2022, 2020)\nNAMED ASSOCIATED PRESS DEFENSIVE ROOKIE OF THE YEAR IN 2020\nMADE NFL DEBUT AND STARTING DEBUT IN WEEK 1 OF 2020 (VS. CLEVELAND)": []
    }
  },
  "4243389": {
    "player_name": "Calvin Austin III",
    "player_url": "https://www.steelers.com/team/players-roster/calvin-austin-iii",
    "player_id": "4243389",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 34 REGULAR-SEASON GAMES (NINE STARTS) IN THREE-YEAR NFL CAREER (PITTSBURGH 2022-24)\nHAS REGISTERED 53 RECEPTIONS FOR 728 YARDS (13.7 AVG.) AND FIVE TDS\nHAS RUSHED 11 TIMES FOR 57 YARDS AND ONE TD\nHAS RETURNED 57 PUNTS FOR 538 YARDS (9.4 AVG.) AND ONE TD\nRECORDED A 73-YARD PUNT RETURN FOR TD IN WEEK 8 OF 2024 VS. N.Y. GIANTS\nNAMED AFC SPECIAL TEAMS PLAYER OF THE WEEK FOR HIS PERFORMANCE IN WEEK 8 VS. N.Y. GIANTS (MONDAY NIGHT FOOTBALL)\nHIS PUNT RETURN FOR TD WAS THE STEELERS FIRST SINCE DIONTAE JOHNSON (85 YARDS) VS. ARIZONA ON DEC. 8, 2019\nFIRST PUNT RETURN FOR TD BY PITTSBURGH AT HOME SINCE ANTONIO BROWN (71 YARDS) VS. INDIANAPOLIS ON DEC. 6, 2015\nTHIRD PLAYER TO REGISTER A TD CATCH AND PUNT RETURN TD ON MONDAY NIGHT FOOTBALL IN THE LAST 20 YEARS (DEZ BRYANT, DALLAS; DEVIN HESTER, CHICAGO)\nONLY PLAYER IN THE NFL WITH A TD RECEPTION OF AT LEAST 50 YARDS AND PUNT RETURN FOR TD OF AT LEAST 70 YARDS ON THE YEAR\nONE OF TWO PLAYERS IN THE LEAGUE WITH A TD RECEPTION OF AT LEAST 50 YARDS AND PUNT RETURN FOR TD OF AT LEAST 70 YARDS IN THE SAME SEASON SINCE 2019 (RASHID SHAHEED, NEW ORLEANS, 2023)\nRANKS FIFTH IN PUNT RETURNS (57), SIXTH IN PUNT-RETURN YARDS (538) AND SIXTH IN PUNT-RETURN AVERAGE (9.4) SINCE ENTERING THE LEAGUE IN 2023\nHAULED IN A 72-YARD TD CATCH IN WEEK 3 OF 2023 AT LAS VEGAS\nMADE NFL DEBUT IN WEEK 1 OF 2023 (VS. SAN FRANCISCO)\nMADE NFL STARTING DEBUT IN WEEK 5 OF 2023 (VS. BALTIMORE)": []
    }
  },
  "4258485": {
    "player_name": "Jon Rhattigan",
    "player_url": "https://www.steelers.com/team/players-roster/jon-rhattigan",
    "player_id": "4258485",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 52 REGULAR-SEASON GAMES (NO STARTS) IN HIS FOUR-YEAR NFL CAREER (SEATTLE 2021-23; CAROLINA 2024)\nHAS REGISTERED EIGHT TACKLES (THREE SOLO) AND ONE FUMBLE RECOVERY\nHAS RECORDED 36 TACKLES (26 SOLO) ON SPECIAL TEAMS\nHAS PLAYED IN ONE CAREER POSTSEASON GAME (NO STARTS)\nRECORDED A CAREER-HIGH 12 TACKLES (SIX SOLO) ON SPECIAL TEAMS IN 2024, WHICH WAS TIED FOR THE SEVENTH-MOST IN THE NFL\nMADE NFL DEBUT IN WEEK 1 OF 2021 (AT INDIANAPOLIS)": []
    }
  },
  "4259252": {
    "player_name": "James Pierre",
    "player_url": "https://www.steelers.com/team/players-roster/james-pierre",
    "player_id": "4259252",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 81 REGULAR-SEASON GAMES (EIGHT STARTS) IN HIS SIX-YEAR CAREER\nHAS REGISTERED 71 TACKLES, (60 SOLO), 11 PASSES DEFENSED, THREE INTERCEPTIONS, ONE FORCED FUMBLE ON DEFENSE AND ONE TACKLE FOR LOSS\nHAS RECORDED 46 TACKLES (28 SOLO), FOUR FORCED FUMBLES AND ONE FUMBLE RECOVERY ON SPECIAL TEAMS\nMADE NFL DEBUT IN WEEK 1 OF 2020 (AT N.Y. GIANTS)\nMADE NFL STARTING DEBUT IN WEEK 2 OF 2021 (VS. LAS VEGAS)": []
    }
  },
  "4361411": {
    "player_name": "Pat Freiermuth",
    "player_url": "https://www.steelers.com/team/players-roster/pat-freiermuth",
    "player_id": "4361411",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 61 CAREER REGULAR-SEASON GAMES (37 STARTS) IN FOUR-YEAR NFL CAREER (PITTSBURGH 2021-24)\nHAS CAUGHT 220 PASSES FOR 2,190 YARDS AND 18 TDS\nHIS 220 RECEPTIONS ARE THE MOST BY A TIGHT END IN FRANCHISE HISTORY OVER THEIR FIRST FOUR YEARS IN THE NFL\nTENTH TIGHT END IN NFL HISTORY TO REACH 100 CAREER RECEPTIONS IN 25 GAMES OR LESS\nREACHED 100 CAREER RECEPTIONS IN HIS 25TH GAME IN THE NFL, WHICH WAS THE 10TH-FEWEST GAMES NEEDED TO REACH 100 RECEPTIONS IN NFL HISTORY\nREACHED 1,000 RECEIVING YARDS IN HIS 26TH CAREER GAME, TIED FOR THE FASTEST BY A TIGHT END IN FRANCHISE HISTORY (ERIC GREEN)\nHIS 2,190 RECEIVING YARDS ARE THE MOST BY A TIGHT END IN FRANCHISE HISTORY OVER THEIR FIRST FOUR YEARS IN THE NFL\nHIS 18 TD CATCHES ARE THE THIRD-MOST BY A TIGHT END IN FRANCHISE HISTORY OVER THEIR FIRST FOUR YEARS IN THE NFL\nRECORDED THE FIRST 100-YARD RECEIVING GAME OF HIS CAREER, FINISHING WITH NINE RECEPTIONS FOR 120 YARDS (BOTH CAREER HIGHS) IN WEEK 12 OF 2023 AT CINCINNATI\nHIS 120 YARDS RECEIVING WERE THE 10TH-MOST IN A SINGLE-GAME BY A TIGHT END IN THE NFL IN 2023\nHIS 120 YARDS RECEIVING WERE THE THIRD-MOST IN A SINGLE-GAME BY A TIGHT END IN FRANCHISE HISTORY\nHIS NINE RECEPTIONS WERE TIED FOR THE FIFTH-MOST IN A SINGLE-GAME BY A TIGHT END IN FRANCHISE HISTORY\nMADE NFL DEBUT IN WEEK 1 OF 2021 (AT BUFFALO)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2021 (AT BUFFALO)": []
    }
  },
  "4361652": {
    "player_name": "Payton Wilson",
    "player_url": "https://www.steelers.com/team/players-roster/payton-wilson",
    "player_id": "4361652",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 17 REGULAR-SEASON GAMES (4 STARTS) IN HIS ONE-YEAR NFL CAREER (PITTSBURGH 2024)\nHAS REGISTERED 71 TACKLES (47 SOLO), THREE TACKLES FOR LOSS, TWO QUARTERBACK HITS, SIX FORCED FUMBLES, TWO PASSES DEFENSED, ONE INTERCEPTION, ONE FORCED FUMBLE AND TWO FUMBLE RECOVERIES\nHAS RECORDED SIX TACKLES (TWO SOLO) ON SPECIAL TEAMS\nMADE NFL START IN WEEK 4 OF 2024 ( AT INDIANAPOLIS)\nMADE NFL DEBUT IN WEEK 1 OF 2024 (AT ATLANTA)": []
    }
  },
  "4362082": {
    "player_name": "D'Shawn Jamison",
    "player_url": "https://www.steelers.com/team/players-roster/d-shawn-jamison",
    "player_id": "4362082",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 15 REGULAR-SEASON GAMES (ONE START) IN TWO-YEAR NFL CAREER (SAN FRANCISCO 2023; CAROLINA 2023; PITTSBURGH 2024)\nHAS REGISTERED FIVE TACKLES (THREE SOLO) AND ONE PASS DEFENSED\nHAS RECORDED FIVE TACKLES (THREE SOLO) ON SPECIAL TEAMS\nMADE NFL DEBUT IN WEEK 2 OF 2023 (VS. NEW ORLEANS)\nMADE NFL STARTING DEBUT IN WEEK 5 OF 2023 (AT DETROIT)": []
    }
  },
  "4363052": {
    "player_name": "Beanie Bishop Jr.",
    "player_url": "https://www.steelers.com/team/players-roster/beanie-bishop-jr",
    "player_id": "4363052",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 17 REGULAR-SEASON GAMES (6 STARTS) OVER HIS ONE-YEAR NFL CAREER (STEELERS 2024)\nHAS REGISTERED 39 TACKLES (25 SOLO), 7 PASSES DEFENSED, FOUR INTERCEPTIONS, TWO TACKLES FOR LOSS, ONE FUMBLE RECOVERY, AND A HALF-SACK OVER HIS ONE-YEAR CAREER.\nMADE NFL DEBUT IN WEEK 1 OF 2024 (AT FALCONS)\nMADE NFL STARTING DEBUT IN WEEK 3 OF 2024 (AT RAVENS)\nSELECTED TO THE 2023 PRO FOOTBALL WRITERS OF AMERICA (PFWA) ALL-ROOKIE TEAM": []
    }
  },
  "4368304": {
    "player_name": "Mason McCormick",
    "player_url": "https://www.steelers.com/team/players-roster/mason-mccormick",
    "player_id": "4368304",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 17 GAMES (14 STARTS)\nMADE NFL START WEEK 4 VERSUS INDIANAPOLIS\nMADE NFL DEBUT WEEK 1 AT ATLANTA\nPAVED THE WAY FOR RB NAJEE HARRIS TO RUSH FOR 100+ YARDS THREE CONSECUTIVE WEEKS (WEEK 6, WEEK 7 AND WEEK 8)": []
    }
  },
  "4371733": {
    "player_name": "Kenneth Gainwell",
    "player_url": "https://www.steelers.com/team/players-roster/kenneth-gainwell",
    "player_id": "4371733",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 66 REGULAR-SEASON GAMES (4 STARTS) OVER HIS FOUR-YEAR NFL CAREER (PHILADELPHIA 2021-24)\nHAS RECORDED 280 CARRIES FOR 1,185 RUSHING YARDS AND 12 RUSHING TD, WHILE ALSO CATCHING 102 PASSES FOR 721 YARDS AND ONE RECEIVING TD\nHELPED PHILADELPHIA WIN SUPER BOWL LIX, CONTRIBUTING ON OFFENSE AND WAS A KEY MEMBER OF THE SPECIAL TEAMS UNIT\nLED THE EAGLES IN BOTH RUSHING YARDS (181) AND SCRIMMAGE YARDS (236) DURING THE 2022 PLAYOFFS, WHICH RESULTED IN A SUPER BOWL LVII APPEARANCE ... AVERAGED 5.5 YARDS PER CARRY WITH 1 TD ON 33 ATTEMPTS\nIN 2021, TIED FOR THE MOST RUSHING TDS (5) BY AN EAGLES ROOKIE IN FRANCHISE HISTORY, JOINING DON JOHNSON (1953) AND STEVE VAN BUREN (1944)": []
    }
  },
  "4372056": {
    "player_name": "Spencer Anderson",
    "player_url": "https://www.steelers.com/team/players-roster/spencer-anderson",
    "player_id": "4372056",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN EIGHT REGULAR-SEASON GAMES (NO STARTS) IN HIS ONE-YEAR NFL CAREER (PITTSBURGH 2023)\nMADE NFL DEBUT IN WEEK 4 OF 2023 (AT HOUSTON)": []
    }
  },
  "4372098": {
    "player_name": "Julius Welschof",
    "player_url": "https://www.steelers.com/team/players-roster/julius-welschof",
    "player_id": "4372098",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT\n\n\n              \n              \n                COLLEGE\n\n              \n              \n                \nPLAYED ONE SEASON AT CHARLOTTE (2023) AND FIVE SEASONS AT MICHIGAN (2018-22)\nSTARTING DEFENSIVE END HAD HIS FINAL COLLEGIATE SEASON CUT SHORT BY INJURY IN 2023\nSTARTED EACH OF THE FIRST FOUR GAMES BEFORE INJURY END HIS LONE CAMPAIGN WITH THE 49ERS\nREGISTERED FOUR TACKLES AND TWO QUARTERBACK HITS IN THE NON-CONFERENCE SEASON\nRECORDED TWO TACKLES VS. SOUTH CAROLINA STATE AND GEORGIA STATE\nPLAYED IN 35 GAMES OVER HIS FOUR PLAYING SEASONS WITH THE WOLVERINES\nAPPEARED IN ALL 14 GAMES IN 2022, MAKING SIX TACKLES AS MICHIGAN REACHED THE COLLEGE FOOTBALL PLAYOFFS\nNAMED THE WOLVERINES' SPECIAL TEAMS PLAYER OF THE WEEK FOLLOWING A PAIR OF SOLO TACKLES AT RUTGERS\nPLAYED IN ALL 14 GAMES IN 2021 AND EARNED A TRIP TO THE COLLEGE FOOTBALL PLAYOFFS\nTWO-TIME ACADEMIC ALL-BIG TEN": []
    }
  },
  "4372492": {
    "player_name": "Cory Trice Jr.",
    "player_url": "https://www.steelers.com/team/players-roster/cory-trice-jr",
    "player_id": "4372492",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN SIX GAMES (1 START) OVER HIS TWO-YEAR NFL CAREER\nHAS REGISTERED 21 TACKLES (15 SOLO), TWO PASSES DEFENSED, ONE INTERCEPTION AND ONE TACKLE FOR LOSS\nMISSED THE 2023 SEASON FOLLOWING A KNEE INJURY SUFFERED IN TRAINING CAMP\nMADE NFL DEBUT IN WEEK 1 OF 2024 (AT FALCONS)\nMADE NFL STARTING DEBUT IN WEEK 18 OF 2024 (VS. BENGALS)": []
    }
  },
  "4373830": {
    "player_name": "Steven Jones",
    "player_url": "https://www.steelers.com/team/players-roster/steven-jones",
    "player_id": "4373830",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT\n\n\n              \n              \n                2024 (JAGUARS)\n\n              \n              \n                \nSPENT THE SEASON ON THE PRACTICE SQUAD": []
    }
  },
  "4382475": {
    "player_name": "Jacob Slade",
    "player_url": "https://www.steelers.com/team/players-roster/jacob-slade",
    "player_id": "4382475",
    "trivia": {}
  },
  "4426359": {
    "player_name": "DeMarvin Leal",
    "player_url": "https://www.steelers.com/team/players-roster/demarvin-leal",
    "player_id": "4426359",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 28 REGULAR-SEASON GAMES (SIX STARTS) IN HIS TWO-YEAR NFL CAREER (PITTSBURGH 2022-24)\nHAS REGISTERED 31 TACKLES (18 SOLO), FOUR PASSES DEFENSED, THREE TACKLES FOR LOSS, THREE QUARTERBACK HITS AND 1.0 SACK\nMADE NFL DEBUT IN WEEK 1 OF 2022 (AT CINCINNATI)\nMADE NFL STARTING DEBUT IN WEEK 5 OF 2022 (AT BUFFALO)": []
    }
  },
  "4426506": {
    "player_name": "Joey Porter Jr.",
    "player_url": "https://www.steelers.com/team/players-roster/joey-porter-jr",
    "player_id": "4426506",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 33 REGULAR-SEASON GAMES (27 STARTS) OVER HIS TWO-YEAR NFL CAREER (STEELERS 2023-24)\nHAS REGISTERED 112 TACKLES (85 SOLO), 17 PASSES DEFENSED, TWO INTERCEPTION AND THREE TACKLES FOR LOSS\nSELECTED TO THE 2023 PRO FOOTBALL WRITERS OF AMERICA (PFWA) ALL-ROOKIE TEAM\nCAPTURED THE JOE GREENE GREAT PERFORMANCE AWARD, PRESENTED TO THE TEAM'S TOP ROOKIE\nFINALIST FOR ASSOCIATED PRESS NFL DEFENSIVE ROOKIE OF THE YEAR\nMADE NFL DEBUT IN WEEK 1 OF 2023 (VS. SAN FRANCISCO)\nMADE NFL STARTING DEBUT IN WEEK 8 OF 2023 (VS. JACKSONVILLE)": []
    }
  },
  "4426694": {
    "player_name": "Keeanu Benton",
    "player_url": "https://www.steelers.com/team/players-roster/keeanu-benton",
    "player_id": "4426694",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 17 CAREER REGULAR-SEASON GAMES (14 STARTS) IN TWO-YEAR NFL CAREER (PITTSBURGH 2023-)\nHAS REGISTERED 72 TACKLES (32 SOLO), 2.0 SACKS, EIGHT PASSES DEFENSED, 16 QUARTERBACK HITS, TWO FORCED FUMBLES, ONE FUMBLE RECOVERY, ONE INTERCEPTION AND THREE TACKLES FOR LOSS\nCOLLECTED HIS FIRST CAREER SACK IN WEEK 3 OF 2023 AT LAS VEGAS\nMADE NFL DEBUT IN WEEK 1 OF 2023 (VS. SAN FRANCISCO)\nMADE NFL STARTING DEBUT IN WEEK 5 OF 2023 (VS. BALTIMORE)": []
    }
  },
  "4426882": {
    "player_name": "Sebastian Castro",
    "player_url": "https://www.steelers.com/team/players-roster/sebastian-castro",
    "player_id": "4426882",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4427170": {
    "player_name": "Troy Fautanu",
    "player_url": "https://www.steelers.com/team/players-roster/troy-fautanu",
    "player_id": "4427170",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nPLAYED IN ONE GAME (ONE START) IN HIS ROOKIE SEASON\nMADE HIS NFL DEBUT, STARTING AT RIGHT TACKLE IN THE WEEK 2 WIN AT DENVER\nMISSED THE REMAINDER OF THE SEASON DUE TO INJURY": []
    }
  },
  "4428119": {
    "player_name": "Lew Nichols",
    "player_url": "https://www.steelers.com/team/players-roster/lew-nichols",
    "player_id": "4428119",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4428990": {
    "player_name": "Broderick Jones",
    "player_url": "https://www.steelers.com/team/players-roster/broderick-jones",
    "player_id": "4428990",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 34 REGULAR-SEASON GAMES (27 STARTS) IN HIS TWO-YEAR NFL CAREER (PITTSBURGH 2023-24)\nMADE NFL DEBUT IN WEEK 1 OF 2023 (VS. SAN FRANCISCO)\nMADE NFL STARTING DEBUT IN WEEK 5 OF 2023 (VS. BALTIMORE)": []
    }
  },
  "4429006": {
    "player_name": "Rakim Jarrett",
    "player_url": "https://www.steelers.com/team/players-roster/rakim-jarrett",
    "player_id": "4429006",
    "trivia": {}
  },
  "4429164": {
    "player_name": "Nick Herbig",
    "player_url": "https://www.steelers.com/team/players-roster/nick-herbig",
    "player_id": "4429164",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 30 REGULAR-SEASON GAMES (FIVE STARTS) IN HIS TWO-YEAR NFL CAREER (PITTSBURGH 2023-2024)\nHAS REGISTERED 44 TACKLES (28 SOLO), 10 TACKLES FOR LOSS, 8.5 SACKS, 14 QUARTERBACK HITS, SIX FORCED FUMBLES AND TWO FUMBLE RECOVERIES\nHAS RECORDED FIVE TACKLES (FOUR SOLO) ON SPECIAL TEAMS\nMADE NFL START IN WEEK 4 OF 2024 (AT INDIANAPOLIS)\nMADE NFL DEBUT IN WEEK 1 OF 2023 (VS. SAN FRANCISCO)": []
    }
  },
  "4429490": {
    "player_name": "Carson Bruener",
    "player_url": "https://www.steelers.com/team/players-roster/carson-bruener",
    "player_id": "4429490",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4429775": {
    "player_name": "Zach Frazier",
    "player_url": "https://www.steelers.com/team/players-roster/zach-frazier",
    "player_id": "4429775",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 15 REGULAR SEASON GAMES (15 STARTS) IN HIS NFL CAREER\nMADE NFL START WEEK 1 AT ATLANTA\nMADE NFL DEBUT WEEK 1 AT ATLANTA\nPAVED THE WAY FOR RB NAJEE HARRIS TO RUSH FOR 100+ YARDS THREE CONSECUTIVE WEEKS (WEEK 6, WEEK 7 AND WEEK 8)": []
    }
  },
  "4429955": {
    "player_name": "Will Howard",
    "player_url": "https://www.steelers.com/team/players-roster/will-howard",
    "player_id": "4429955",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4430802": {
    "player_name": "Darnell Washington",
    "player_url": "https://www.steelers.com/team/players-roster/darnell-washington",
    "player_id": "4430802",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 34 CAREER REGULAR-SEASON GAMES (16 STARTS) IN TWO-YEAR NFL CAREER (PITTSBURGH 2023)\nHAS CAUGHT 26 PASSES FOR 261 YARDS AND ONE TOUCHDOWN (10.0 AVG.)\nMADE NFL DEBUT IN WEEK 1 OF 2023 (VS. SAN FRANCISCO)\nMADE NFL STARTING DEBUT IN WEEK 2 OF 2023 (VS. CLEVELAND)\nCAUGHT HIS FIRST CAREER TOUCHDOWN PASS IN WEEK 2 OF 2024 (AT DENVER)": []
    }
  },
  "4430947": {
    "player_name": "Yahya Black",
    "player_url": "https://www.steelers.com/team/players-roster/yahya-black",
    "player_id": "4430947",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4431492": {
    "player_name": "Roman Wilson",
    "player_url": "https://www.steelers.com/team/players-roster/roman-wilson",
    "player_id": "4431492",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN ONE REGULAR-SEASON GAME (NO STARTS) IN ONE-YEAR NFL CAREER (PITTSBURGH 2024)\nHAS REGISTERED FOUR SNAPS ON OFFENSE\nMADE NFL DEBUT IN WEEK 6 OF 2024 (AT LAS VEGAS)\nSPENT MOST OF THE 2024 SEASON ON THE RESERVE/INJURED LIST": []
    }
  },
  "4431590": {
    "player_name": "Jack Sawyer",
    "player_url": "https://www.steelers.com/team/players-roster/jack-sawyer",
    "player_id": "4431590",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4567979": {
    "player_name": "Brandin Echols",
    "player_url": "https://www.steelers.com/team/players-roster/brandin-echols",
    "player_id": "4567979",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 57 REGULAR-SEASON GAMES (19 STARTS) OVER HIS FOUR-YEAR NFL CAREER (N.Y. JETS 2021-24)\nHAS REGISTERED 113 TACKLES (88 SOLO), 16 PASSES DEFENSED, FIVE INTERCEPTIONS, THREE TACKLES FOR LOSS, TWO INTERCEPTIONS RETURNED FOR TD AND ONE FUMBLE RECOVERY\nVOTED PEPSI ZERO SUGAR ROOKIE OF THE WEEK IN WEEK 15 OF 2021 AT MIAMI AFTER HE FINISHED WITH AN INTERCEPTION RETURN FOR TD, ONLY THE SECOND DEFENSIVE TD BY A JETS ROOKIE (JONATHAN VILMA) SINCE 2000\nMADE NFL DEBUT IN WEEK 1 OF 2021 (AT CAROLINA)\nMADE NFL STARTING DEBUT IN WEEK 1 OF 2021 (AT CAROLINA)": []
    }
  },
  "4569474": {
    "player_name": "Logan Lee",
    "player_url": "https://www.steelers.com/team/players-roster/logan-lee",
    "player_id": "4569474",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4569987": {
    "player_name": "Jaylen Warren",
    "player_url": "https://www.steelers.com/team/players-roster/jaylen-warren",
    "player_id": "4569987",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS PLAYED IN 48 REGULAR-SEASON GAMES (NO STARTS) IN HIS THREE-YEAR NFL CAREER (PITTSBURGH 2022-24)\nHAS RECORDED 1,674 RUSHING YARDS AND SIX RUSHING TDS ON 346 ATTEMPTS (4.8 AVG.) AND ADDED 127 CATCHES FOR 894 YARDS (7.0 AVG.)\nWARREN AND NAJEE HARRIS EACH ECLIPSED 1,000 SCRIMMAGE YARDS IN 2023\nWARREN AND HARRIS WERE THE FOURTH DUO IN FRANCHISE HISTORY TO ECLIPSE 1,000 SCRIMMAGE YARDS IN THE SAME SEASON AND FIRST SINCE WALTER ABERCROMBIE AND EARNEST JACKSON IN 1986 (ABERCROMBIE AND FRANK POLLARD ALSO ACCOMPLISHED THE FEAT IN 1985, AS DID FRANCO HARRIS AND ROCKY BLEIER IN 1976)\nWARREN AND HARRIS EACH RUSHED FOR AT LEAST 750 YARDS IN 2023\nFIRST PAIR OF STEELERS' RUNNING BACKS TO RUSH FOR 750 OR MORE YARDS IN THE SAME SINCE SEASON 2004 (JEROME BETTIS, 941; DUCE STALEY, 830)\nMADE NFL DEBUT IN WEEK 1 OF 2022 (AT CINCINNATI)": []
    }
  },
  "4570738": {
    "player_name": "Ke'Shawn Williams",
    "player_url": "https://www.steelers.com/team/players-roster/ke-shawn-williams",
    "player_id": "4570738",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4570898": {
    "player_name": "Dylan Cook",
    "player_url": "https://www.steelers.com/team/players-roster/dylan-cook",
    "player_id": "4570898",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4573443": {
    "player_name": "Kyler Baugh",
    "player_url": "https://www.steelers.com/team/players-roster/kyler-baugh",
    "player_id": "4573443",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4590720": {
    "player_name": "Domenique Davis",
    "player_url": "https://www.steelers.com/team/players-roster/domenique-davis",
    "player_id": "4590720",
    "trivia": {}
  },
  "4608004": {
    "player_name": "Donte Kent",
    "player_url": "https://www.steelers.com/team/players-roster/donte-kent",
    "player_id": "4608004",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4682980": {
    "player_name": "Derrick Harmon",
    "player_url": "https://www.steelers.com/team/players-roster/derrick-harmon",
    "player_id": "4682980",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4691005": {
    "player_name": "Daryl Porter Jr.",
    "player_url": "https://www.steelers.com/team/players-roster/daryl-porter-jr",
    "player_id": "4691005",
    "trivia": {}
  },
  "4694237": {
    "player_name": "Max Hurleman",
    "player_url": "https://www.steelers.com/team/players-roster/max-hurleman",
    "player_id": "4694237",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4695800": {
    "player_name": "JJ Galbreath",
    "player_url": "https://www.steelers.com/team/players-roster/jj-galbreath",
    "player_id": "4695800",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4819231": {
    "player_name": "Kaleb Johnson",
    "player_url": "https://www.steelers.com/team/players-roster/kaleb-johnson",
    "player_id": "4819231",
    "trivia": {
      "PRO CAREER\n\n              \n              \n                \nHAS YET TO MAKE NFL DEBUT": []
    }
  },
  "4885455": {
    "player_name": "Gareth Warren",
    "player_url": "https://www.steelers.com/team/players-roster/gareth-warren",
    "player_id": "4885455",
    "trivia": {}
  }
}